{
    "text": [
        "ملاحظات سريرية - مريض السكري:\nالتاريخ: 30 مايو 2023\nاسم المريض: فاطمة علي\nالعنوان: شارع الحرية، مبنى رقم 456، حي السلام، القاهرة\nالرمز البريدي: 67890\nالبلد: مصر\nاسم المستشفى: مستشفى الشفاء\nاسم الطبيب: د. محمد صلاح\nتفاصيل الحالة:\nالمريضة فاطمة علي، البالغة من العمر 42 عامًا، مصابة بمرض السكري من النوع 2. تشكو من زيادة في العطش والجوع المفرط والتبول المتكرر. تم تشخيصها بمرض السكري بعد فحص شامل وفحوصات مخبرية.\nالخطة:\nتم وصف دواء فموي لخفض مستوى السكر في الدم.\nيجب على المريضة مراجعة الطبيب بانتظام وإجراء اختبارات السكر في الدم بانتظام.\nيتعين على المريضة اتباع نظام غذائي صحي ومتوازن، يشمل الحد من استهلاك السكريات والنشويات.\nيجب مراقبة ضغط الدم والكولسترول أيضًا ومراعاة التعليمات الطبية المتعلقة بتلك الحالات.\nتعليم المريضة بشأن أعراض الارتفاع أو الانخفاض الحاد في مستوى السكر في الدم وكيفية التعامل معها.",
        "ملاحظات سريرية - مريض الربو:\nالتاريخ: 30 مايو 2023\nاسم المريضة: ليلى حسن\nالعنوان: شارع المعرفة، مبنى رقم 789، حي الأمانة، جدة\nالرمز البريدي: 54321\nالبلد: المملكة العربية السعودية\nاسم المستشفى: مستشفى النور\nاسم الطبيب: د. أميرة أحمد\nتفاصيل الحالة:\nالمريضة ليلى حسن، البالغة من العمر 35 عامًا، تعاني من مرض الربو المزمن. تشكو من ضيق التنفس والسعال المتكرر والشهيق الشديد. تم تشخيصها بمرض الربو بناءً على تاريخها الطبي واختبارات وظائف الرئة.\nالخطة:\nتم وصف مضادات الالتهاب غير الستيرويدية والموسعات القصبية لتحسين التنفس وتقليل التهيج.\nيجب على المريضة حمل معها جهاز الاستنشاق في حالة حدوث نوبة ربو حادة.\nيتعين على المريضة تجنب التحسس من العوامل المسببة للربو، مثل الدخان والغبار والحيوانات الأليفة.\nيجب مراقبة وظائف الرئة بانتظام ومتابعة التعليمات الطبية المتعلقة بمرض الربو.\nتعليم المريضة بشأن كيفية استخدام جهاز الاستنشاق بشكل صحيح وتقنيات التنفس الصحيح",
        "ملاحظات سريرية - مريض الضغط العالي:\nالتاريخ: 30 مايو 2023\nاسم المريض: خالد محمد\nالعنوان: شارع الشفاء، مبنى رقم 321، حي السعادة، الإسكندرية\nالرمز البريدي: 12345\nالبلد: مصر\nاسم المستشفى: مستشفى الرحمة\nاسم الطبيب: د. ليلى علي\nتفاصيل الحالة:\nالمريض خالد محمد، البالغ من العمر 60 عامًا، يعاني من ضغط الدم الارتفاعي. يشكو من الصداع المستمر والدوخة والتعب الشديد. تم تشخيصه بارتفاع ضغط الدم بعد فحص شامل وقياسات متكررة.\nالخطة:\nتم وصف دواءًا لخفض ضغط الدم ومراقبة المستويات بانتظام.\nيجب على المريض مراجعة الطبيب بانتظام لتقييم استجابته للعلاج وضبط الجرعات إن لزم الأمر.\nتعليم المريض بشأن أهمية اتباع نمط حياة صحي، بما في ذلك تجنب الأطعمة الغنية بالصوديوم وممارسة الرياضة بانتظام.\nيتعين على المريض مراقبة الوزن وتجنب التوتر النفسي والتدخين.\nينصح المريض بإجراء فحوصات الكولسترول والسكر في الدم بانتظام.",
        "ملاحظات سريرية - مريضة الغدة الدرقية:\nالتاريخ: 30 مايو 2023\nاسم المريضة: سارة عبد الرحمن\nالعنوان: شارع النجاح، مبنى رقم 987، حي الأمل، القاهرة\nالرمز البريدي: 67890\nالبلد: مصر\nاسم المستشفى: مستشفى الأمل\nاسم الطبيب: د. أحمد مصطفى\nتفاصيل الحالة:\nالمريضة سارة عبد الرحمن، البالغة من العمر 45 عامًا، تعاني من اضطرابات في الغدة الدرقية. تشكو من زيادة الوزن والتعب والاكتئاب. تم تشخيصها بفرط نشاط الغدة الدرقية بعد فحص الدم والتحاليل المخبرية.\nالخطة:\nتم وصف العلاج الدوائي لتنظيم وظيفة الغدة الدرقية ومراقبة المستويات الهرمونية بانتظام.\nيجب على المريضة مراجعة الطبيب بانتظام لتقييم استجابتها للعلاج وضبط الجرعات إن لزم الأمر.\nتعليم المريضة بشأن أهمية اتباع نمط حياة صحي، بما في ذلك تناول الغذاء الصحي وممارسة النشاط البدني بانتظام.\nينصح المريضة بإجراء فحوصات الدم الدورية لمتابعة مستويات الهرمونات وضبط العلاج.\nتعليم المريضة بشأن الأعراض التي يجب عليها مراقبتها والتقارير الفورية للطبيب، مثل التعب الشديد أو زيادة الوزن المفرط."
    ],
    "masking_policy": "masked_fixed_length_chars"
}