{"cells":[{"cell_type":"markdown","source":["# Patient Cohort Building with NLP and Knowledge Graphs"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"f1de2a0d-9944-4c3e-8a9c-bcfd111efa63","inputWidgets":{},"title":""}}},{"cell_type":"markdown","source":["In this notebook, we will build a Neo4j Clinical Knowledge Graph (KG) from the output of a Spark NLP pipeline that contains NER (named entity recognition) and RE (relation extraction) pretrained models. After creating the knowledge graph, we will query the KG to get some insightful results.\n\nTo obtain the visualizations included below, run the provided queries (just the query, without quotation marks) in Neo4j Browser. This can be accessed from the Instances screen in Neo4j via the `>_ Query` tab. The password for the instance is required to access the graph database. \n\nPlease notice that the nodes and the relations color codes might differ from the ones provided here, as they depend on the individual browser settings. Also, you may obtain slightly different outputs, these are related to the versions of the pretrained models used in the Spark NLP pipelines."],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"6b0be4cf-5d46-47ad-a1a3-40e297a56092","inputWidgets":{},"title":""}}},{"cell_type":"markdown","source":["[Cluster Setup](https://nlp.johnsnowlabs.com/docs/en/licensed_install#install-on-databricks)"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"489733e8-dad8-4411-a1f8-7e25f798aa60","inputWidgets":{},"title":""}}},{"cell_type":"code","source":["%pip install neo4j"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"1018860d-4d98-43c1-8055-c539a56b3388","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Python interpreter will be restarted.\nRequirement already satisfied: neo4j in /local_disk0/.ephemeral_nfs/envs/pythonEnv-030bce05-9f0c-42e6-a945-ab85d56c90d5/lib/python3.8/site-packages (5.2.1)\nRequirement already satisfied: pytz in /databricks/python3/lib/python3.8/site-packages (from neo4j) (2020.5)\nWARNING: You are using pip version 21.0.1; however, version 22.3.1 is available.\nYou should consider upgrading via the &#39;/local_disk0/.ephemeral_nfs/envs/pythonEnv-030bce05-9f0c-42e6-a945-ab85d56c90d5/bin/python -m pip install --upgrade pip&#39; command.\nPython interpreter will be restarted.\n</div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Python interpreter will be restarted.\nRequirement already satisfied: neo4j in /local_disk0/.ephemeral_nfs/envs/pythonEnv-030bce05-9f0c-42e6-a945-ab85d56c90d5/lib/python3.8/site-packages (5.2.1)\nRequirement already satisfied: pytz in /databricks/python3/lib/python3.8/site-packages (from neo4j) (2020.5)\nWARNING: You are using pip version 21.0.1; however, version 22.3.1 is available.\nYou should consider upgrading via the &#39;/local_disk0/.ephemeral_nfs/envs/pythonEnv-030bce05-9f0c-42e6-a945-ab85d56c90d5/bin/python -m pip install --upgrade pip&#39; command.\nPython interpreter will be restarted.\n</div>"]}}],"execution_count":0},{"cell_type":"code","source":["%pip install tqdm"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"23bdc4b0-43b2-481c-912d-34400f9e78f1","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Python interpreter will be restarted.\nRequirement already satisfied: tqdm in /databricks/python3/lib/python3.8/site-packages (4.59.0)\nWARNING: You are using pip version 21.0.1; however, version 22.3.1 is available.\nYou should consider upgrading via the &#39;/local_disk0/.ephemeral_nfs/envs/pythonEnv-030bce05-9f0c-42e6-a945-ab85d56c90d5/bin/python -m pip install --upgrade pip&#39; command.\nPython interpreter will be restarted.\n</div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Python interpreter will be restarted.\nRequirement already satisfied: tqdm in /databricks/python3/lib/python3.8/site-packages (4.59.0)\nWARNING: You are using pip version 21.0.1; however, version 22.3.1 is available.\nYou should consider upgrading via the &#39;/local_disk0/.ephemeral_nfs/envs/pythonEnv-030bce05-9f0c-42e6-a945-ab85d56c90d5/bin/python -m pip install --upgrade pip&#39; command.\nPython interpreter will be restarted.\n</div>"]}}],"execution_count":0},{"cell_type":"markdown","source":["## Creation of the Knowledge Graph"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"121eab9c-a514-44c6-a2d7-b06742f84077","inputWidgets":{},"title":""}}},{"cell_type":"markdown","source":["### Neo4j Connection"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"ced7c2d1-bbdb-41dc-8f0b-2e1891445d24","inputWidgets":{},"title":""}}},{"cell_type":"code","source":["from neo4j import GraphDatabase\n\nimport time\nfrom tqdm import tqdm\nimport pandas as pd\nimport json"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"49596557-9fd2-4765-9400-b8ec3a46cd95","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\"></div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\"></div>"]}}],"execution_count":0},{"cell_type":"code","source":["notes_path='/FileStore/HLS/jsl_kg/data/'\npatient_df = pd.read_csv(f'/dbfs{notes_path}data.csv', sep=';')\npatient_df"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"ca62a1c6-1c55-4e8c-bb92-5c446bef58f6","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Out[2]: </div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Out[2]: </div>"]}},{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>subject_id</th>\n      <th>date</th>\n      <th>text</th>\n      <th>gender</th>\n      <th>dateOfBirth</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>Admission Date:  [**2167-2-16**]       Dischar...</td>\n      <td>F</td>\n      <td>2099-05-05</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>19823</td>\n      <td>2167-11-27</td>\n      <td>Admission Date:  [**2167-11-27**]       Discha...</td>\n      <td>F</td>\n      <td>2099-05-05</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>19823</td>\n      <td>2170-10-12</td>\n      <td>Admission Date:  [**2170-9-19**]              ...</td>\n      <td>F</td>\n      <td>2099-05-05</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>19823</td>\n      <td>2172-06-22</td>\n      <td>Admission Date:  [**2172-6-13**]              ...</td>\n      <td>F</td>\n      <td>2099-05-05</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>19823</td>\n      <td>2167-12-07</td>\n      <td>PATIENT/TEST INFORMATION:\\nIndication: Aortic ...</td>\n      <td>F</td>\n      <td>2099-05-05</td>\n    </tr>\n    <tr>\n      <th>...</th>\n      <td>...</td>\n      <td>...</td>\n      <td>...</td>\n      <td>...</td>\n      <td>...</td>\n    </tr>\n    <tr>\n      <th>960</th>\n      <td>70004</td>\n      <td>2182-06-14</td>\n      <td>[**2182-6-14**] 10:45 AM\\n MR HEAD W &amp; W/O CON...</td>\n      <td>M</td>\n      <td>2127-12-06</td>\n    </tr>\n    <tr>\n      <th>961</th>\n      <td>70004</td>\n      <td>2182-06-25</td>\n      <td>FDG TUMOR IMAGING (PET-CT)                    ...</td>\n      <td>M</td>\n      <td>2127-12-06</td>\n    </tr>\n    <tr>\n      <th>962</th>\n      <td>70004</td>\n      <td>2182-08-05</td>\n      <td>[**2182-8-5**] 11:46 AM\\n MR HEAD W &amp; W/O CONT...</td>\n      <td>M</td>\n      <td>2127-12-06</td>\n    </tr>\n    <tr>\n      <th>963</th>\n      <td>70004</td>\n      <td>2182-08-23</td>\n      <td>FDG TUMOR IMAGING (PET-CT)                    ...</td>\n      <td>M</td>\n      <td>2127-12-06</td>\n    </tr>\n    <tr>\n      <th>964</th>\n      <td>70004</td>\n      <td>2182-08-16</td>\n      <td>[**2182-8-16**] 9:41 AM\\n MR [**Name13 (STitle...</td>\n      <td>M</td>\n      <td>2127-12-06</td>\n    </tr>\n  </tbody>\n</table>\n<p>965 rows × 5 columns</p>\n</div>","textData":null,"removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"htmlSandbox","arguments":{}}},"output_type":"display_data","data":{"text/html":["<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>subject_id</th>\n      <th>date</th>\n      <th>text</th>\n      <th>gender</th>\n      <th>dateOfBirth</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>Admission Date:  [**2167-2-16**]       Dischar...</td>\n      <td>F</td>\n      <td>2099-05-05</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>19823</td>\n      <td>2167-11-27</td>\n      <td>Admission Date:  [**2167-11-27**]       Discha...</td>\n      <td>F</td>\n      <td>2099-05-05</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>19823</td>\n      <td>2170-10-12</td>\n      <td>Admission Date:  [**2170-9-19**]              ...</td>\n      <td>F</td>\n      <td>2099-05-05</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>19823</td>\n      <td>2172-06-22</td>\n      <td>Admission Date:  [**2172-6-13**]              ...</td>\n      <td>F</td>\n      <td>2099-05-05</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>19823</td>\n      <td>2167-12-07</td>\n      <td>PATIENT/TEST INFORMATION:\\nIndication: Aortic ...</td>\n      <td>F</td>\n      <td>2099-05-05</td>\n    </tr>\n    <tr>\n      <th>...</th>\n      <td>...</td>\n      <td>...</td>\n      <td>...</td>\n      <td>...</td>\n      <td>...</td>\n    </tr>\n    <tr>\n      <th>960</th>\n      <td>70004</td>\n      <td>2182-06-14</td>\n      <td>[**2182-6-14**] 10:45 AM\\n MR HEAD W &amp; W/O CON...</td>\n      <td>M</td>\n      <td>2127-12-06</td>\n    </tr>\n    <tr>\n      <th>961</th>\n      <td>70004</td>\n      <td>2182-06-25</td>\n      <td>FDG TUMOR IMAGING (PET-CT)                    ...</td>\n      <td>M</td>\n      <td>2127-12-06</td>\n    </tr>\n    <tr>\n      <th>962</th>\n      <td>70004</td>\n      <td>2182-08-05</td>\n      <td>[**2182-8-5**] 11:46 AM\\n MR HEAD W &amp; W/O CONT...</td>\n      <td>M</td>\n      <td>2127-12-06</td>\n    </tr>\n    <tr>\n      <th>963</th>\n      <td>70004</td>\n      <td>2182-08-23</td>\n      <td>FDG TUMOR IMAGING (PET-CT)                    ...</td>\n      <td>M</td>\n      <td>2127-12-06</td>\n    </tr>\n    <tr>\n      <th>964</th>\n      <td>70004</td>\n      <td>2182-08-16</td>\n      <td>[**2182-8-16**] 9:41 AM\\n MR [**Name13 (STitle...</td>\n      <td>M</td>\n      <td>2127-12-06</td>\n    </tr>\n  </tbody>\n</table>\n<p>965 rows × 5 columns</p>\n</div>"]}}],"execution_count":0},{"cell_type":"code","source":["patient_demographics = patient_df[['subject_id', 'gender', 'dateOfBirth']].drop_duplicates().reset_index(drop=True)\npatient_demographics"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"7ac7e85d-f0f8-48c9-b14d-c715aff2e589","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Out[3]: </div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Out[3]: </div>"]}},{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>subject_id</th>\n      <th>gender</th>\n      <th>dateOfBirth</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>19823</td>\n      <td>F</td>\n      <td>2099-05-05</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>22015</td>\n      <td>M</td>\n      <td>2085-10-04</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>17494</td>\n      <td>F</td>\n      <td>2193-10-01</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>21153</td>\n      <td>M</td>\n      <td>2057-03-03</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>12200</td>\n      <td>M</td>\n      <td>2136-06-17</td>\n    </tr>\n    <tr>\n      <th>5</th>\n      <td>23266</td>\n      <td>M</td>\n      <td>2122-03-16</td>\n    </tr>\n    <tr>\n      <th>6</th>\n      <td>75632</td>\n      <td>M</td>\n      <td>2118-09-04</td>\n    </tr>\n    <tr>\n      <th>7</th>\n      <td>27386</td>\n      <td>M</td>\n      <td>2114-08-20</td>\n    </tr>\n    <tr>\n      <th>8</th>\n      <td>28552</td>\n      <td>F</td>\n      <td>2044-10-22</td>\n    </tr>\n    <tr>\n      <th>9</th>\n      <td>70004</td>\n      <td>M</td>\n      <td>2127-12-06</td>\n    </tr>\n  </tbody>\n</table>\n</div>","textData":null,"removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"htmlSandbox","arguments":{}}},"output_type":"display_data","data":{"text/html":["<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>subject_id</th>\n      <th>gender</th>\n      <th>dateOfBirth</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>19823</td>\n      <td>F</td>\n      <td>2099-05-05</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>22015</td>\n      <td>M</td>\n      <td>2085-10-04</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>17494</td>\n      <td>F</td>\n      <td>2193-10-01</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>21153</td>\n      <td>M</td>\n      <td>2057-03-03</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>12200</td>\n      <td>M</td>\n      <td>2136-06-17</td>\n    </tr>\n    <tr>\n      <th>5</th>\n      <td>23266</td>\n      <td>M</td>\n      <td>2122-03-16</td>\n    </tr>\n    <tr>\n      <th>6</th>\n      <td>75632</td>\n      <td>M</td>\n      <td>2118-09-04</td>\n    </tr>\n    <tr>\n      <th>7</th>\n      <td>27386</td>\n      <td>M</td>\n      <td>2114-08-20</td>\n    </tr>\n    <tr>\n      <th>8</th>\n      <td>28552</td>\n      <td>F</td>\n      <td>2044-10-22</td>\n    </tr>\n    <tr>\n      <th>9</th>\n      <td>70004</td>\n      <td>M</td>\n      <td>2127-12-06</td>\n    </tr>\n  </tbody>\n</table>\n</div>"]}}],"execution_count":0},{"cell_type":"code","source":["filename = 'posology_RE_rxnorm_w_drug_resolutions.csv'\nfolderdir = f'/FileStore/HLS/jsl_kg/data/'\npos_RE_result =  pd.read_csv(f'/dbfs{folderdir+filename}')\npos_RE_result.head()"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"d5c3634e-913c-4c2c-9f19-dc045f6ae8f8","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Out[4]: </div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Out[4]: </div>"]}},{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>subject_id</th>\n      <th>date</th>\n      <th>relation</th>\n      <th>entity1</th>\n      <th>entity1_begin</th>\n      <th>entity1_end</th>\n      <th>chunk1</th>\n      <th>entity2</th>\n      <th>entity2_begin</th>\n      <th>entity2_end</th>\n      <th>chunk2</th>\n      <th>confidence</th>\n      <th>rx_text</th>\n      <th>sent_id</th>\n      <th>ner_chunk</th>\n      <th>entity</th>\n      <th>rxnorm_code</th>\n      <th>all_codes</th>\n      <th>resolutions</th>\n      <th>drug_resolution</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>DRUG-FORM</td>\n      <td>DRUG</td>\n      <td>1391</td>\n      <td>1399</td>\n      <td>albuterol</td>\n      <td>FORM</td>\n      <td>1414</td>\n      <td>1423</td>\n      <td>nebulizers</td>\n      <td>1.0</td>\n      <td>Albuterol nebulizers</td>\n      <td>0</td>\n      <td>Albuterol nebulizers</td>\n      <td>NaN</td>\n      <td>2108226</td>\n      <td>['2108226' '1154602' '370790' '1154603' '21082...</td>\n      <td>['albuterol Inhalation Solution' 'albuterol In...</td>\n      <td>albuterol inhalation solution</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>DRUG-FORM</td>\n      <td>DRUG</td>\n      <td>1405</td>\n      <td>1412</td>\n      <td>atrovent</td>\n      <td>FORM</td>\n      <td>1414</td>\n      <td>1423</td>\n      <td>nebulizers</td>\n      <td>1.0</td>\n      <td>Atrovent nebulizers</td>\n      <td>0</td>\n      <td>Atrovent nebulizers</td>\n      <td>NaN</td>\n      <td>2108451</td>\n      <td>['2108451' '1173573' '379767' '1173576' '24637...</td>\n      <td>['ipratropium Inhalation Solution [Atrovent]' ...</td>\n      <td>ipratropium inhalation solution [atrovent]</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>STRENGTH-DRUG</td>\n      <td>STRENGTH</td>\n      <td>1539</td>\n      <td>1543</td>\n      <td>40 mg</td>\n      <td>DRUG</td>\n      <td>1551</td>\n      <td>1555</td>\n      <td>lasix</td>\n      <td>1.0</td>\n      <td>Lasix 40 mg</td>\n      <td>0</td>\n      <td>Lasix 40 mg</td>\n      <td>NaN</td>\n      <td>200809</td>\n      <td>['200809' '617319' '103919' '1871459' '201286'...</td>\n      <td>['furosemide 40 MG Oral Tablet [Lasix]' 'atorv...</td>\n      <td>furosemide 40 mg oral tablet [lasix]</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>ROUTE-DRUG</td>\n      <td>ROUTE</td>\n      <td>1548</td>\n      <td>1549</td>\n      <td>iv</td>\n      <td>DRUG</td>\n      <td>1551</td>\n      <td>1555</td>\n      <td>lasix</td>\n      <td>1.0</td>\n      <td>Lasix</td>\n      <td>0</td>\n      <td>Lasix</td>\n      <td>NaN</td>\n      <td>202991</td>\n      <td>['202991' '151963' '2256936' '2256930' '104372...</td>\n      <td>['Lasix' 'Lasma' 'lasmiditan Oral Tablet' 'las...</td>\n      <td>lasix</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>DRUG-STRENGTH</td>\n      <td>DRUG</td>\n      <td>2336</td>\n      <td>2341</td>\n      <td>amaryl</td>\n      <td>STRENGTH</td>\n      <td>2343</td>\n      <td>2348</td>\n      <td>2.0 mg</td>\n      <td>1.0</td>\n      <td>Amaryl 2.0 mg</td>\n      <td>0</td>\n      <td>Amaryl 2.0 mg</td>\n      <td>NaN</td>\n      <td>901295</td>\n      <td>['901295' '153591' '1310138' '213799' '2399657...</td>\n      <td>['sodium fluoride 2.2 MG [Ludent]' 'glimepirid...</td>\n      <td>sodium fluoride 2.2 mg [ludent]</td>\n    </tr>\n  </tbody>\n</table>\n</div>","textData":null,"removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"htmlSandbox","arguments":{}}},"output_type":"display_data","data":{"text/html":["<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>subject_id</th>\n      <th>date</th>\n      <th>relation</th>\n      <th>entity1</th>\n      <th>entity1_begin</th>\n      <th>entity1_end</th>\n      <th>chunk1</th>\n      <th>entity2</th>\n      <th>entity2_begin</th>\n      <th>entity2_end</th>\n      <th>chunk2</th>\n      <th>confidence</th>\n      <th>rx_text</th>\n      <th>sent_id</th>\n      <th>ner_chunk</th>\n      <th>entity</th>\n      <th>rxnorm_code</th>\n      <th>all_codes</th>\n      <th>resolutions</th>\n      <th>drug_resolution</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>DRUG-FORM</td>\n      <td>DRUG</td>\n      <td>1391</td>\n      <td>1399</td>\n      <td>albuterol</td>\n      <td>FORM</td>\n      <td>1414</td>\n      <td>1423</td>\n      <td>nebulizers</td>\n      <td>1.0</td>\n      <td>Albuterol nebulizers</td>\n      <td>0</td>\n      <td>Albuterol nebulizers</td>\n      <td>NaN</td>\n      <td>2108226</td>\n      <td>['2108226' '1154602' '370790' '1154603' '21082...</td>\n      <td>['albuterol Inhalation Solution' 'albuterol In...</td>\n      <td>albuterol inhalation solution</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>DRUG-FORM</td>\n      <td>DRUG</td>\n      <td>1405</td>\n      <td>1412</td>\n      <td>atrovent</td>\n      <td>FORM</td>\n      <td>1414</td>\n      <td>1423</td>\n      <td>nebulizers</td>\n      <td>1.0</td>\n      <td>Atrovent nebulizers</td>\n      <td>0</td>\n      <td>Atrovent nebulizers</td>\n      <td>NaN</td>\n      <td>2108451</td>\n      <td>['2108451' '1173573' '379767' '1173576' '24637...</td>\n      <td>['ipratropium Inhalation Solution [Atrovent]' ...</td>\n      <td>ipratropium inhalation solution [atrovent]</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>STRENGTH-DRUG</td>\n      <td>STRENGTH</td>\n      <td>1539</td>\n      <td>1543</td>\n      <td>40 mg</td>\n      <td>DRUG</td>\n      <td>1551</td>\n      <td>1555</td>\n      <td>lasix</td>\n      <td>1.0</td>\n      <td>Lasix 40 mg</td>\n      <td>0</td>\n      <td>Lasix 40 mg</td>\n      <td>NaN</td>\n      <td>200809</td>\n      <td>['200809' '617319' '103919' '1871459' '201286'...</td>\n      <td>['furosemide 40 MG Oral Tablet [Lasix]' 'atorv...</td>\n      <td>furosemide 40 mg oral tablet [lasix]</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>ROUTE-DRUG</td>\n      <td>ROUTE</td>\n      <td>1548</td>\n      <td>1549</td>\n      <td>iv</td>\n      <td>DRUG</td>\n      <td>1551</td>\n      <td>1555</td>\n      <td>lasix</td>\n      <td>1.0</td>\n      <td>Lasix</td>\n      <td>0</td>\n      <td>Lasix</td>\n      <td>NaN</td>\n      <td>202991</td>\n      <td>['202991' '151963' '2256936' '2256930' '104372...</td>\n      <td>['Lasix' 'Lasma' 'lasmiditan Oral Tablet' 'las...</td>\n      <td>lasix</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>DRUG-STRENGTH</td>\n      <td>DRUG</td>\n      <td>2336</td>\n      <td>2341</td>\n      <td>amaryl</td>\n      <td>STRENGTH</td>\n      <td>2343</td>\n      <td>2348</td>\n      <td>2.0 mg</td>\n      <td>1.0</td>\n      <td>Amaryl 2.0 mg</td>\n      <td>0</td>\n      <td>Amaryl 2.0 mg</td>\n      <td>NaN</td>\n      <td>901295</td>\n      <td>['901295' '153591' '1310138' '213799' '2399657...</td>\n      <td>['sodium fluoride 2.2 MG [Ludent]' 'glimepirid...</td>\n      <td>sodium fluoride 2.2 mg [ludent]</td>\n    </tr>\n  </tbody>\n</table>\n</div>"]}}],"execution_count":0},{"cell_type":"code","source":["filename = 'ner_jsl_slim_results.csv'\nfolderdir = f'/FileStore/HLS/jsl_kg/data/'\nner_DF_result = pd.read_csv(f'/dbfs{folderdir+filename}')\nner_DF_result.head()"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"05624d98-d9f9-4444-8221-87680818b49a","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Out[5]: </div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Out[5]: </div>"]}},{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>subject_id</th>\n      <th>date</th>\n      <th>sentence_id</th>\n      <th>chunk</th>\n      <th>begin</th>\n      <th>end</th>\n      <th>ner_label</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>0</td>\n      <td>Shortness of breath</td>\n      <td>178</td>\n      <td>196</td>\n      <td>Symptom</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>0</td>\n      <td>cough</td>\n      <td>199</td>\n      <td>203</td>\n      <td>Symptom</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>1</td>\n      <td>diabetes type II</td>\n      <td>345</td>\n      <td>360</td>\n      <td>Disease_Syndrome_Disorder</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>1</td>\n      <td>congestive heart failure</td>\n      <td>363</td>\n      <td>386</td>\n      <td>Disease_Syndrome_Disorder</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>1</td>\n      <td>hypertension</td>\n      <td>413</td>\n      <td>424</td>\n      <td>Disease_Syndrome_Disorder</td>\n    </tr>\n  </tbody>\n</table>\n</div>","textData":null,"removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"htmlSandbox","arguments":{}}},"output_type":"display_data","data":{"text/html":["<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>subject_id</th>\n      <th>date</th>\n      <th>sentence_id</th>\n      <th>chunk</th>\n      <th>begin</th>\n      <th>end</th>\n      <th>ner_label</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>0</td>\n      <td>Shortness of breath</td>\n      <td>178</td>\n      <td>196</td>\n      <td>Symptom</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>0</td>\n      <td>cough</td>\n      <td>199</td>\n      <td>203</td>\n      <td>Symptom</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>1</td>\n      <td>diabetes type II</td>\n      <td>345</td>\n      <td>360</td>\n      <td>Disease_Syndrome_Disorder</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>1</td>\n      <td>congestive heart failure</td>\n      <td>363</td>\n      <td>386</td>\n      <td>Disease_Syndrome_Disorder</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>1</td>\n      <td>hypertension</td>\n      <td>413</td>\n      <td>424</td>\n      <td>Disease_Syndrome_Disorder</td>\n    </tr>\n  </tbody>\n</table>\n</div>"]}}],"execution_count":0},{"cell_type":"code","source":["class Neo4jConnection:\n    def __init__(self, uri, user, pwd):\n        self.__uri = uri\n        self.__user = user\n        self.__pwd = pwd\n        self.__driver = None\n        try:\n            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__pwd))\n        except Exception as e:\n            print(\"Failed to create the driver:\", e)\n        \n    def close(self):\n        if self.__driver is not None:\n            self.__driver.close()\n        \n    def query(self, query, parameters=None, db=None):\n        assert self.__driver is not None, \"Driver not initialized!\"\n        session = None\n        response = None\n        try: \n            session = self.__driver.session(database=db) if db is not None else self.__driver.session() \n            response = list(session.run(query, parameters))\n        except Exception as e:\n            print(\"Query failed:\", e)\n        finally: \n            if session is not None:\n                session.close()\n        return response"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"eba176cc-224f-4e99-abf8-68fe6842dd15","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\"></div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\"></div>"]}}],"execution_count":0},{"cell_type":"code","source":["# Credentials for Neo4j graph database\n\n#uri = dbutils.secrets.get(\"solution-accelerator-cicd\",\"neo4j-uri\") # replace with '<Neo4j Aura instance uri>' or set up this secret in your own workspace\nuri = ''\n\n#pwd = dbutils.secrets.get(\"solution-accelerator-cicd\",\"neo4j-password\") # replace with '<Neo4j Aura instance password>' or set up this secret in your own workspace\npwd = ''\n\n#user = dbutils.secrets.get(\"solution-accelerator-cicd\",\"neo4j-user\") # replace with '<Neo4j Aura instance user>' or set up this secret in your own workspace\nuser='neo4j'\n\n# Establish the connection with Neo4j GDB\nconn = Neo4jConnection(uri=uri, user=user , pwd=pwd)"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"eb660e4d-3a84-4224-ba10-71096ebe6e7b","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\"></div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\"></div>"]}}],"execution_count":0},{"cell_type":"markdown","source":["**Creating constraints:**"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"4d0e9544-d492-4b11-bc06-a82958962793","inputWidgets":{},"title":""}}},{"cell_type":"code","source":["conn.query('CREATE CONSTRAINT patients IF NOT EXISTS FOR (p:Patient) REQUIRE p.name IS UNIQUE;')\nconn.query('CREATE CONSTRAINT rx_norm_codes IF NOT EXISTS FOR (rx:RxNorm) REQUIRE rx.code IS UNIQUE;')\nconn.query('CREATE CONSTRAINT drugs IF NOT EXISTS FOR (drug:Drug) REQUIRE drug.name IS UNIQUE;')\nconn.query('CREATE CONSTRAINT ners IF NOT EXISTS FOR (n:NER) REQUIRE n.name IS UNIQUE;')\nconn.query('CREATE CONSTRAINT symptoms IF NOT EXISTS FOR (s:Symptom) REQUIRE s.name IS UNIQUE;')\nconn.query('CREATE CONSTRAINT bodyParts IF NOT EXISTS FOR (bp:BodyPart) REQUIRE bp.name IS UNIQUE;')\nconn.query('CREATE CONSTRAINT procedures IF NOT EXISTS FOR (p:Procedure) REQUIRE p.name IS UNIQUE;')\nconn.query('CREATE CONSTRAINT tests IF NOT EXISTS FOR (t:Test) REQUIRE t.name IS UNIQUE;')\nconn.query('CREATE CONSTRAINT dsds IF NOT EXISTS FOR (dsd:DSD) REQUIRE dsd.name IS UNIQUE;')"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"aec8c4db-03e8-4d7b-b1b5-85e85c0bfe1c","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Out[8]: []</div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Out[8]: []</div>"]}}],"execution_count":0},{"cell_type":"markdown","source":["**defining helper functions:**"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"a2a0d7ab-e7f3-4f99-a709-2b48f1c15843","inputWidgets":{},"title":""}}},{"cell_type":"code","source":["def update_data(query, rows, batch_size = 10000):\n    total = 0\n    batch = 0\n    start = time.time()\n    result = None\n    while batch * batch_size < len(rows):\n        res = conn.query(query, parameters={'rows': rows[batch*batch_size:(batch+1)*batch_size].to_dict('records')})\n        total += res[0]['total']\n        batch += 1\n        result = {\"total\":total, \"batches\":batch, \"time\":time.time()-start}\n        print(result)\n    return result"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"9da13240-253a-43f6-84fb-4e895d22a844","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\"></div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\"></div>"]}}],"execution_count":0},{"cell_type":"code","source":["def add_patients(rows, batch_size=10000):\n    query = '''\n    UNWIND $rows as row\n    MERGE(p:Patient{name:row.subject_id}) \n    ON CREATE SET p.gender      = row.gender,\n                  p.dateOfBirth = row.dateOfBirth\n\n    WITH p\n    MATCH (p)\n    RETURN count(*) as total\n    '''\n    return update_data(query, rows, batch_size)\n\nadd_patients(patient_demographics)"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"d8601c17-15ee-4253-ba9c-dd17d76e338b","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">{&#39;total&#39;: 10, &#39;batches&#39;: 1, &#39;time&#39;: 0.8437516689300537}\nOut[10]: {&#39;total&#39;: 10, &#39;batches&#39;: 1, &#39;time&#39;: 0.8437516689300537}</div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">{&#39;total&#39;: 10, &#39;batches&#39;: 1, &#39;time&#39;: 0.8437516689300537}\nOut[10]: {&#39;total&#39;: 10, &#39;batches&#39;: 1, &#39;time&#39;: 0.8437516689300537}</div>"]}}],"execution_count":0},{"cell_type":"code","source":["def add_drugs_ners(rows, batch_size=1000):\n    query = '''\n    UNWIND $rows as row\n    \n    MERGE(p:Patient{name:row.subject_id}) \n    MERGE(rx:RxNorm{code:row.rxnorm_code})\n    MERGE (p)-[:RXNORM_CODE{date:date(row.date)}]->(rx)\n    \n    MERGE (d:Drug{name:row.drug_resolution})\n    MERGE (rx)-[:DRUG_GENERIC{date:date(row.date), patient_name:row.subject_id}]->(d)\n    \n    MERGE(n1:NER{name:row.chunk1}) ON CREATE SET n1.type=row.entity1\n    MERGE(n2:NER{name:row.chunk2}) ON CREATE SET n2.type=row.entity2\n    \n    WITH *\n    MATCH (d:Drug{name:row.drug_resolution}), (n1:NER{name:row.chunk1}), (n2:NER{name:row.chunk2})\n    CALL apoc.create.relationship (d,row.entity1, {patient_name:row.subject_id, date:date(row.date)}, n1) YIELD rel as relx\n    CALL apoc.create.relationship (d,row.entity2, {patient_name:row.subject_id, date:date(row.date)}, n2) YIELD rel as rely\n    \n    WITH d\n    MATCH (d)\n    RETURN count(*) as total  \n    '''\n    return update_data(query, rows, batch_size)\n  \nadd_drugs_ners(pos_RE_result)"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"a0dcb46d-0046-4b7c-949a-b83d712de0a9","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">{&#39;total&#39;: 1000, &#39;batches&#39;: 1, &#39;time&#39;: 3.2101218700408936}\n{&#39;total&#39;: 2000, &#39;batches&#39;: 2, &#39;time&#39;: 4.3216471672058105}\n{&#39;total&#39;: 2822, &#39;batches&#39;: 3, &#39;time&#39;: 5.10021448135376}\nOut[11]: {&#39;total&#39;: 2822, &#39;batches&#39;: 3, &#39;time&#39;: 5.10021448135376}</div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">{&#39;total&#39;: 1000, &#39;batches&#39;: 1, &#39;time&#39;: 3.2101218700408936}\n{&#39;total&#39;: 2000, &#39;batches&#39;: 2, &#39;time&#39;: 4.3216471672058105}\n{&#39;total&#39;: 2822, &#39;batches&#39;: 3, &#39;time&#39;: 5.10021448135376}\nOut[11]: {&#39;total&#39;: 2822, &#39;batches&#39;: 3, &#39;time&#39;: 5.10021448135376}</div>"]}}],"execution_count":0},{"cell_type":"markdown","source":["**splitting dataframe into multiple dataframes by ner_label and creating nodes and relationships**"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"33c69bf3-49dd-4064-8245-57113ae938a2","inputWidgets":{},"title":""}}},{"cell_type":"code","source":["# spliting dataframe into multiple dataframe by ner_label\ngrouped        = ner_DF_result.groupby('ner_label')\ndf_symptom     = grouped.get_group('Symptom')\ndf_dsd         = grouped.get_group('Disease_Syndrome_Disorder')\ndf_test        = grouped.get_group('Test')\ndf_bodyPart    = grouped.get_group('Body_Part')\ndf_procedure   = grouped.get_group('Procedure')"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"1b6a13bd-6cfd-4b7f-9722-390155ef60a8","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\"></div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\"></div>"]}}],"execution_count":0},{"cell_type":"code","source":["def add_symptoms(rows, batch_size=500):\n    query = '''\n    UNWIND $rows as row\n    MATCH(p:Patient{name:row.subject_id})\n    MERGE(n:Symptom {name:row.chunk})\n    MERGE (p)-[:IS_SYMPTOM{date:date(row.date)}]->(n)\n\n    WITH n\n    MATCH (n)\n    RETURN count(*) as total  \n    '''\n    return update_data(query, rows, batch_size)\n  \nadd_symptoms(df_symptom)"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"241afda4-a28a-444e-812c-e0567137d8cf","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">{&#39;total&#39;: 500, &#39;batches&#39;: 1, &#39;time&#39;: 0.45644640922546387}\n{&#39;total&#39;: 1000, &#39;batches&#39;: 2, &#39;time&#39;: 0.6220967769622803}\n{&#39;total&#39;: 1500, &#39;batches&#39;: 3, &#39;time&#39;: 0.8090381622314453}\n{&#39;total&#39;: 2000, &#39;batches&#39;: 4, &#39;time&#39;: 1.1413421630859375}\n{&#39;total&#39;: 2500, &#39;batches&#39;: 5, &#39;time&#39;: 1.3175573348999023}\n{&#39;total&#39;: 3000, &#39;batches&#39;: 6, &#39;time&#39;: 1.5434551239013672}\n{&#39;total&#39;: 3500, &#39;batches&#39;: 7, &#39;time&#39;: 1.7250628471374512}\n{&#39;total&#39;: 4000, &#39;batches&#39;: 8, &#39;time&#39;: 1.8746984004974365}\n{&#39;total&#39;: 4500, &#39;batches&#39;: 9, &#39;time&#39;: 2.036344528198242}\n{&#39;total&#39;: 5000, &#39;batches&#39;: 10, &#39;time&#39;: 2.198303461074829}\n{&#39;total&#39;: 5139, &#39;batches&#39;: 11, &#39;time&#39;: 2.344296932220459}\nOut[13]: {&#39;total&#39;: 5139, &#39;batches&#39;: 11, &#39;time&#39;: 2.344296932220459}</div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">{&#39;total&#39;: 500, &#39;batches&#39;: 1, &#39;time&#39;: 0.45644640922546387}\n{&#39;total&#39;: 1000, &#39;batches&#39;: 2, &#39;time&#39;: 0.6220967769622803}\n{&#39;total&#39;: 1500, &#39;batches&#39;: 3, &#39;time&#39;: 0.8090381622314453}\n{&#39;total&#39;: 2000, &#39;batches&#39;: 4, &#39;time&#39;: 1.1413421630859375}\n{&#39;total&#39;: 2500, &#39;batches&#39;: 5, &#39;time&#39;: 1.3175573348999023}\n{&#39;total&#39;: 3000, &#39;batches&#39;: 6, &#39;time&#39;: 1.5434551239013672}\n{&#39;total&#39;: 3500, &#39;batches&#39;: 7, &#39;time&#39;: 1.7250628471374512}\n{&#39;total&#39;: 4000, &#39;batches&#39;: 8, &#39;time&#39;: 1.8746984004974365}\n{&#39;total&#39;: 4500, &#39;batches&#39;: 9, &#39;time&#39;: 2.036344528198242}\n{&#39;total&#39;: 5000, &#39;batches&#39;: 10, &#39;time&#39;: 2.198303461074829}\n{&#39;total&#39;: 5139, &#39;batches&#39;: 11, &#39;time&#39;: 2.344296932220459}\nOut[13]: {&#39;total&#39;: 5139, &#39;batches&#39;: 11, &#39;time&#39;: 2.344296932220459}</div>"]}}],"execution_count":0},{"cell_type":"code","source":["def add_dsds(rows, batch_size=500):\n    query = '''\n    UNWIND $rows as row\n    MATCH(p:Patient{name:row.subject_id})\n    MERGE(n:DSD {name:row.chunk})\n    MERGE (p)-[:IS_DSD{date:date(row.date)}]->(n)\n\n    WITH n\n    MATCH (n)\n    RETURN count(*) as total  \n    '''\n    return update_data(query, rows, batch_size)\n  \nadd_dsds(df_dsd)"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"6d8e6517-58af-4900-8ff6-cfbd5b38914a","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">{&#39;total&#39;: 500, &#39;batches&#39;: 1, &#39;time&#39;: 0.27756166458129883}\n{&#39;total&#39;: 1000, &#39;batches&#39;: 2, &#39;time&#39;: 0.44432568550109863}\n{&#39;total&#39;: 1500, &#39;batches&#39;: 3, &#39;time&#39;: 0.6141841411590576}\n{&#39;total&#39;: 2000, &#39;batches&#39;: 4, &#39;time&#39;: 0.7843613624572754}\n{&#39;total&#39;: 2500, &#39;batches&#39;: 5, &#39;time&#39;: 0.9802432060241699}\n{&#39;total&#39;: 2918, &#39;batches&#39;: 6, &#39;time&#39;: 1.1699182987213135}\nOut[14]: {&#39;total&#39;: 2918, &#39;batches&#39;: 6, &#39;time&#39;: 1.1699182987213135}</div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">{&#39;total&#39;: 500, &#39;batches&#39;: 1, &#39;time&#39;: 0.27756166458129883}\n{&#39;total&#39;: 1000, &#39;batches&#39;: 2, &#39;time&#39;: 0.44432568550109863}\n{&#39;total&#39;: 1500, &#39;batches&#39;: 3, &#39;time&#39;: 0.6141841411590576}\n{&#39;total&#39;: 2000, &#39;batches&#39;: 4, &#39;time&#39;: 0.7843613624572754}\n{&#39;total&#39;: 2500, &#39;batches&#39;: 5, &#39;time&#39;: 0.9802432060241699}\n{&#39;total&#39;: 2918, &#39;batches&#39;: 6, &#39;time&#39;: 1.1699182987213135}\nOut[14]: {&#39;total&#39;: 2918, &#39;batches&#39;: 6, &#39;time&#39;: 1.1699182987213135}</div>"]}}],"execution_count":0},{"cell_type":"code","source":["def add_tests(rows, batch_size=500):\n    query = '''\n    UNWIND $rows as row\n    MATCH(p:Patient{name:row.subject_id})\n    MERGE(n:Test {name:row.chunk})\n    MERGE (p)-[:IS_TEST{date:date(row.date)}]->(n)\n\n    WITH n\n    MATCH (n)\n    RETURN count(*) as total  \n    '''\n    return update_data(query, rows, batch_size)\n  \nadd_tests(df_test)"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"84a1ea0c-7858-429f-8e0c-78a1535445b7","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">{&#39;total&#39;: 500, &#39;batches&#39;: 1, &#39;time&#39;: 0.38529467582702637}\n{&#39;total&#39;: 1000, &#39;batches&#39;: 2, &#39;time&#39;: 0.5414767265319824}\n{&#39;total&#39;: 1500, &#39;batches&#39;: 3, &#39;time&#39;: 0.6970810890197754}\n{&#39;total&#39;: 2000, &#39;batches&#39;: 4, &#39;time&#39;: 0.8540139198303223}\n{&#39;total&#39;: 2500, &#39;batches&#39;: 5, &#39;time&#39;: 1.014988899230957}\n{&#39;total&#39;: 3000, &#39;batches&#39;: 6, &#39;time&#39;: 1.1720948219299316}\n{&#39;total&#39;: 3230, &#39;batches&#39;: 7, &#39;time&#39;: 1.2981398105621338}\nOut[15]: {&#39;total&#39;: 3230, &#39;batches&#39;: 7, &#39;time&#39;: 1.2981398105621338}</div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">{&#39;total&#39;: 500, &#39;batches&#39;: 1, &#39;time&#39;: 0.38529467582702637}\n{&#39;total&#39;: 1000, &#39;batches&#39;: 2, &#39;time&#39;: 0.5414767265319824}\n{&#39;total&#39;: 1500, &#39;batches&#39;: 3, &#39;time&#39;: 0.6970810890197754}\n{&#39;total&#39;: 2000, &#39;batches&#39;: 4, &#39;time&#39;: 0.8540139198303223}\n{&#39;total&#39;: 2500, &#39;batches&#39;: 5, &#39;time&#39;: 1.014988899230957}\n{&#39;total&#39;: 3000, &#39;batches&#39;: 6, &#39;time&#39;: 1.1720948219299316}\n{&#39;total&#39;: 3230, &#39;batches&#39;: 7, &#39;time&#39;: 1.2981398105621338}\nOut[15]: {&#39;total&#39;: 3230, &#39;batches&#39;: 7, &#39;time&#39;: 1.2981398105621338}</div>"]}}],"execution_count":0},{"cell_type":"code","source":["def add_bodyParts(rows, batch_size=500):\n    query = '''\n    UNWIND $rows as row\n    MATCH(p:Patient{name:row.subject_id})\n    MERGE(n:BodyPart {name:row.chunk})\n    MERGE (p)-[:IS_BODYPART{date:date(row.date)}]->(n)\n\n    WITH n\n    MATCH (n)\n    RETURN count(*) as total\n    '''\n    return update_data(query, rows, batch_size)\n  \nadd_bodyParts(df_bodyPart)"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"d1f931cd-20c8-401b-bb94-f78419aee2c1","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">{&#39;total&#39;: 500, &#39;batches&#39;: 1, &#39;time&#39;: 0.32681894302368164}\n{&#39;total&#39;: 1000, &#39;batches&#39;: 2, &#39;time&#39;: 0.49231433868408203}\n{&#39;total&#39;: 1500, &#39;batches&#39;: 3, &#39;time&#39;: 0.6432676315307617}\n{&#39;total&#39;: 2000, &#39;batches&#39;: 4, &#39;time&#39;: 0.7984635829925537}\n{&#39;total&#39;: 2500, &#39;batches&#39;: 5, &#39;time&#39;: 0.9524669647216797}\n{&#39;total&#39;: 3000, &#39;batches&#39;: 6, &#39;time&#39;: 1.0937657356262207}\n{&#39;total&#39;: 3500, &#39;batches&#39;: 7, &#39;time&#39;: 1.2467918395996094}\n{&#39;total&#39;: 4000, &#39;batches&#39;: 8, &#39;time&#39;: 1.3895652294158936}\n{&#39;total&#39;: 4138, &#39;batches&#39;: 9, &#39;time&#39;: 1.489633560180664}\nOut[16]: {&#39;total&#39;: 4138, &#39;batches&#39;: 9, &#39;time&#39;: 1.489633560180664}</div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">{&#39;total&#39;: 500, &#39;batches&#39;: 1, &#39;time&#39;: 0.32681894302368164}\n{&#39;total&#39;: 1000, &#39;batches&#39;: 2, &#39;time&#39;: 0.49231433868408203}\n{&#39;total&#39;: 1500, &#39;batches&#39;: 3, &#39;time&#39;: 0.6432676315307617}\n{&#39;total&#39;: 2000, &#39;batches&#39;: 4, &#39;time&#39;: 0.7984635829925537}\n{&#39;total&#39;: 2500, &#39;batches&#39;: 5, &#39;time&#39;: 0.9524669647216797}\n{&#39;total&#39;: 3000, &#39;batches&#39;: 6, &#39;time&#39;: 1.0937657356262207}\n{&#39;total&#39;: 3500, &#39;batches&#39;: 7, &#39;time&#39;: 1.2467918395996094}\n{&#39;total&#39;: 4000, &#39;batches&#39;: 8, &#39;time&#39;: 1.3895652294158936}\n{&#39;total&#39;: 4138, &#39;batches&#39;: 9, &#39;time&#39;: 1.489633560180664}\nOut[16]: {&#39;total&#39;: 4138, &#39;batches&#39;: 9, &#39;time&#39;: 1.489633560180664}</div>"]}}],"execution_count":0},{"cell_type":"code","source":["def add_procedures(rows, batch_size=500):\n    query = '''\n    UNWIND $rows as row\n    MATCH(p:Patient{name:row.subject_id})\n    MERGE(n:Procedure {name:row.chunk})\n    MERGE (p)-[:IS_PROCEDURE{date:date(row.date)}]->(n)\n\n    WITH n\n    MATCH (n)\n    RETURN count(*) as total  \n    '''\n    return update_data(query, rows, batch_size)\n  \nadd_procedures(df_procedure)"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"ae0981d5-9629-4ed5-853a-3e2adccb1194","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">{&#39;total&#39;: 500, &#39;batches&#39;: 1, &#39;time&#39;: 0.3208756446838379}\n{&#39;total&#39;: 1000, &#39;batches&#39;: 2, &#39;time&#39;: 0.4613306522369385}\n{&#39;total&#39;: 1436, &#39;batches&#39;: 3, &#39;time&#39;: 0.6083276271820068}\nOut[17]: {&#39;total&#39;: 1436, &#39;batches&#39;: 3, &#39;time&#39;: 0.6083276271820068}</div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">{&#39;total&#39;: 500, &#39;batches&#39;: 1, &#39;time&#39;: 0.3208756446838379}\n{&#39;total&#39;: 1000, &#39;batches&#39;: 2, &#39;time&#39;: 0.4613306522369385}\n{&#39;total&#39;: 1436, &#39;batches&#39;: 3, &#39;time&#39;: 0.6083276271820068}\nOut[17]: {&#39;total&#39;: 1436, &#39;batches&#39;: 3, &#39;time&#39;: 0.6083276271820068}</div>"]}}],"execution_count":0},{"cell_type":"code","source":["query_string = '''\nCALL db.labels() YIELD label\nCALL apoc.cypher.run('MATCH (:`'+label+'`) RETURN count(*) as count',{}) YIELD value\nRETURN label, value.count as size\n'''\ndf_nodes = pd.DataFrame([dict(_) for _ in conn.query(query_string)])\ndf_nodes"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"62dc3b1d-18e2-4781-a8d6-ed77ce3349d6","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Out[18]: </div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Out[18]: </div>"]}},{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>label</th>\n      <th>size</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>Patient</td>\n      <td>10</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>RxNorm</td>\n      <td>1083</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>Drug</td>\n      <td>1083</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>NER</td>\n      <td>915</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>Symptom</td>\n      <td>2682</td>\n    </tr>\n    <tr>\n      <th>5</th>\n      <td>BodyPart</td>\n      <td>1221</td>\n    </tr>\n    <tr>\n      <th>6</th>\n      <td>Procedure</td>\n      <td>675</td>\n    </tr>\n    <tr>\n      <th>7</th>\n      <td>Test</td>\n      <td>1258</td>\n    </tr>\n    <tr>\n      <th>8</th>\n      <td>DSD</td>\n      <td>1179</td>\n    </tr>\n  </tbody>\n</table>\n</div>","textData":null,"removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"htmlSandbox","arguments":{}}},"output_type":"display_data","data":{"text/html":["<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>label</th>\n      <th>size</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>Patient</td>\n      <td>10</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>RxNorm</td>\n      <td>1083</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>Drug</td>\n      <td>1083</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>NER</td>\n      <td>915</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>Symptom</td>\n      <td>2682</td>\n    </tr>\n    <tr>\n      <th>5</th>\n      <td>BodyPart</td>\n      <td>1221</td>\n    </tr>\n    <tr>\n      <th>6</th>\n      <td>Procedure</td>\n      <td>675</td>\n    </tr>\n    <tr>\n      <th>7</th>\n      <td>Test</td>\n      <td>1258</td>\n    </tr>\n    <tr>\n      <th>8</th>\n      <td>DSD</td>\n      <td>1179</td>\n    </tr>\n  </tbody>\n</table>\n</div>"]}}],"execution_count":0},{"cell_type":"code","source":["query_string = '''\nCALL db.relationshipTypes() YIELD relationshipType as type\nCALL apoc.cypher.run('MATCH ()-[:`'+type+'`]->() RETURN count(*) as count',{}) YIELD value\nRETURN type, value.count as size\n'''\ndf_relationships = pd.DataFrame([dict(_) for _ in conn.query(query_string)])\ndf_relationships"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"03ba37dc-e80d-4a4f-ba79-a41e755f0d46","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Out[19]: </div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Out[19]: </div>"]}},{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>type</th>\n      <th>size</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>RXNORM_CODE</td>\n      <td>1704</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>DRUG_GENERIC</td>\n      <td>1704</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>DRUG</td>\n      <td>14110</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>FORM</td>\n      <td>1220</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>STRENGTH</td>\n      <td>4035</td>\n    </tr>\n    <tr>\n      <th>5</th>\n      <td>ROUTE</td>\n      <td>4695</td>\n    </tr>\n    <tr>\n      <th>6</th>\n      <td>FREQUENCY</td>\n      <td>2460</td>\n    </tr>\n    <tr>\n      <th>7</th>\n      <td>DOSAGE</td>\n      <td>1635</td>\n    </tr>\n    <tr>\n      <th>8</th>\n      <td>DURATION</td>\n      <td>65</td>\n    </tr>\n    <tr>\n      <th>9</th>\n      <td>IS_SYMPTOM</td>\n      <td>4157</td>\n    </tr>\n    <tr>\n      <th>10</th>\n      <td>IS_DSD</td>\n      <td>2103</td>\n    </tr>\n    <tr>\n      <th>11</th>\n      <td>IS_TEST</td>\n      <td>2361</td>\n    </tr>\n    <tr>\n      <th>12</th>\n      <td>IS_BODYPART</td>\n      <td>3240</td>\n    </tr>\n    <tr>\n      <th>13</th>\n      <td>IS_PROCEDURE</td>\n      <td>1014</td>\n    </tr>\n  </tbody>\n</table>\n</div>","textData":null,"removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"htmlSandbox","arguments":{}}},"output_type":"display_data","data":{"text/html":["<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>type</th>\n      <th>size</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>RXNORM_CODE</td>\n      <td>1704</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>DRUG_GENERIC</td>\n      <td>1704</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>DRUG</td>\n      <td>14110</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>FORM</td>\n      <td>1220</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>STRENGTH</td>\n      <td>4035</td>\n    </tr>\n    <tr>\n      <th>5</th>\n      <td>ROUTE</td>\n      <td>4695</td>\n    </tr>\n    <tr>\n      <th>6</th>\n      <td>FREQUENCY</td>\n      <td>2460</td>\n    </tr>\n    <tr>\n      <th>7</th>\n      <td>DOSAGE</td>\n      <td>1635</td>\n    </tr>\n    <tr>\n      <th>8</th>\n      <td>DURATION</td>\n      <td>65</td>\n    </tr>\n    <tr>\n      <th>9</th>\n      <td>IS_SYMPTOM</td>\n      <td>4157</td>\n    </tr>\n    <tr>\n      <th>10</th>\n      <td>IS_DSD</td>\n      <td>2103</td>\n    </tr>\n    <tr>\n      <th>11</th>\n      <td>IS_TEST</td>\n      <td>2361</td>\n    </tr>\n    <tr>\n      <th>12</th>\n      <td>IS_BODYPART</td>\n      <td>3240</td>\n    </tr>\n    <tr>\n      <th>13</th>\n      <td>IS_PROCEDURE</td>\n      <td>1014</td>\n    </tr>\n  </tbody>\n</table>\n</div>"]}}],"execution_count":0},{"cell_type":"markdown","source":["**database schema visualization**"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"486de12d-157f-41e0-9f1a-e482f6ae5560","inputWidgets":{},"title":""}}},{"cell_type":"code","source":["# To get the following visualization run the query in the Neo4j Browser\nquery_string = '''\nCALL db.schema.visualization()\n'''\n"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"e31f8689-5040-4444-b733-f249af36f6d1","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\"></div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\"></div>"]}}],"execution_count":0},{"cell_type":"markdown","source":["<img src=\"https://raw.githubusercontent.com/iamvarol/blogposts/main/databricks/images/db_viz.png\">"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"946c7b90-b91b-4b41-969e-3232663a9734","inputWidgets":{},"title":""}}},{"cell_type":"markdown","source":["## Queries"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"1a1ef0a8-3d46-4ff3-b1e6-a2170f5c29d5","inputWidgets":{},"title":""}}},{"cell_type":"markdown","source":["**patient 21153's prescriptions:**"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"3bc91208-8e62-4fbc-8991-ca6c826302fb","inputWidgets":{},"title":""}}},{"cell_type":"code","source":["patient_name = '21153'\nquery_part1 = 'MATCH (p:Patient)-[rel_rx]->(rx:RxNorm)-[rel_d]->(d:Drug)-[rel_n]->(n:NER) ' #  \nquery_part2 = f'WHERE p.name ={patient_name} AND rel_n.date=rel_rx.date AND rel_n.patient_name=p.name ' # \nquery_part3 = '''RETURN DISTINCT\n                 p.name as patient_name,\n                 rel_rx.date as date,\n                 d.name as drug_generic_name,  \n                 rx.code as rxnorm_code,\n                 COALESCE(n.name,'') +  \"(\" + COALESCE (type(rel_n), \"\") + \")\" as details\n                 '''\nquery_string = query_part1 + query_part2 + query_part3\n\ndf = pd.DataFrame([dict(_) for _ in conn.query(query_string)])\ndf = df.drop_duplicates(subset= ['patient_name', 'date', 'drug_generic_name'])\ndf = df.groupby(['patient_name', 'date', 'drug_generic_name', 'rxnorm_code']).agg(lambda x: ' '.join(x)).reset_index()\ndf"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"5bbea30d-207e-4588-9a51-efb72655894f","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Out[21]: </div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Out[21]: </div>"]}},{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>patient_name</th>\n      <th>date</th>\n      <th>drug_generic_name</th>\n      <th>rxnorm_code</th>\n      <th>details</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>21153</td>\n      <td>2109-12-17</td>\n      <td>dex4</td>\n      <td>607868</td>\n      <td>iv(ROUTE)</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>21153</td>\n      <td>2109-12-17</td>\n      <td>everolimus 2 mg tablet for oral suspension [af...</td>\n      <td>1310138</td>\n      <td>2 units(DOSAGE)</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>21153</td>\n      <td>2109-12-18</td>\n      <td>cidaflex</td>\n      <td>1013644</td>\n      <td>celexa(DRUG)</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>21153</td>\n      <td>2109-12-18</td>\n      <td>clorsulon oral solution</td>\n      <td>1006411</td>\n      <td>po(ROUTE)</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>21153</td>\n      <td>2109-12-18</td>\n      <td>crolom</td>\n      <td>216281</td>\n      <td>drip(ROUTE)</td>\n    </tr>\n    <tr>\n      <th>...</th>\n      <td>...</td>\n      <td>...</td>\n      <td>...</td>\n      <td>...</td>\n      <td>...</td>\n    </tr>\n    <tr>\n      <th>147</th>\n      <td>21153</td>\n      <td>2110-10-20</td>\n      <td>cotab a</td>\n      <td>799044</td>\n      <td>contrast(DRUG)</td>\n    </tr>\n    <tr>\n      <th>148</th>\n      <td>21153</td>\n      <td>2110-10-20</td>\n      <td>dibucaine 1 mg</td>\n      <td>335534</td>\n      <td>lidocaine(DRUG)</td>\n    </tr>\n    <tr>\n      <th>149</th>\n      <td>21153</td>\n      <td>2110-10-20</td>\n      <td>ofev</td>\n      <td>1592743</td>\n      <td>contrast(DRUG)</td>\n    </tr>\n    <tr>\n      <th>150</th>\n      <td>21153</td>\n      <td>2110-12-02</td>\n      <td>10 ml sodium chloride 9 mg/ml injection</td>\n      <td>1807637</td>\n      <td>normal\\n saline(DRUG)</td>\n    </tr>\n    <tr>\n      <th>151</th>\n      <td>21153</td>\n      <td>2110-12-02</td>\n      <td>lidocaine 8 mg/ml topical oil</td>\n      <td>2123154</td>\n      <td>lidocaine(DRUG)</td>\n    </tr>\n  </tbody>\n</table>\n<p>152 rows × 5 columns</p>\n</div>","textData":null,"removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"htmlSandbox","arguments":{}}},"output_type":"display_data","data":{"text/html":["<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>patient_name</th>\n      <th>date</th>\n      <th>drug_generic_name</th>\n      <th>rxnorm_code</th>\n      <th>details</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>21153</td>\n      <td>2109-12-17</td>\n      <td>dex4</td>\n      <td>607868</td>\n      <td>iv(ROUTE)</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>21153</td>\n      <td>2109-12-17</td>\n      <td>everolimus 2 mg tablet for oral suspension [af...</td>\n      <td>1310138</td>\n      <td>2 units(DOSAGE)</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>21153</td>\n      <td>2109-12-18</td>\n      <td>cidaflex</td>\n      <td>1013644</td>\n      <td>celexa(DRUG)</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>21153</td>\n      <td>2109-12-18</td>\n      <td>clorsulon oral solution</td>\n      <td>1006411</td>\n      <td>po(ROUTE)</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>21153</td>\n      <td>2109-12-18</td>\n      <td>crolom</td>\n      <td>216281</td>\n      <td>drip(ROUTE)</td>\n    </tr>\n    <tr>\n      <th>...</th>\n      <td>...</td>\n      <td>...</td>\n      <td>...</td>\n      <td>...</td>\n      <td>...</td>\n    </tr>\n    <tr>\n      <th>147</th>\n      <td>21153</td>\n      <td>2110-10-20</td>\n      <td>cotab a</td>\n      <td>799044</td>\n      <td>contrast(DRUG)</td>\n    </tr>\n    <tr>\n      <th>148</th>\n      <td>21153</td>\n      <td>2110-10-20</td>\n      <td>dibucaine 1 mg</td>\n      <td>335534</td>\n      <td>lidocaine(DRUG)</td>\n    </tr>\n    <tr>\n      <th>149</th>\n      <td>21153</td>\n      <td>2110-10-20</td>\n      <td>ofev</td>\n      <td>1592743</td>\n      <td>contrast(DRUG)</td>\n    </tr>\n    <tr>\n      <th>150</th>\n      <td>21153</td>\n      <td>2110-12-02</td>\n      <td>10 ml sodium chloride 9 mg/ml injection</td>\n      <td>1807637</td>\n      <td>normal\\n saline(DRUG)</td>\n    </tr>\n    <tr>\n      <th>151</th>\n      <td>21153</td>\n      <td>2110-12-02</td>\n      <td>lidocaine 8 mg/ml topical oil</td>\n      <td>2123154</td>\n      <td>lidocaine(DRUG)</td>\n    </tr>\n  </tbody>\n</table>\n<p>152 rows × 5 columns</p>\n</div>"]}}],"execution_count":0},{"cell_type":"markdown","source":["**patient 21153's journey in medical records:symptoms, procedures, disease-syndrome-disorders, test, drugs & rxnorms**"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"1133f66f-4f46-4783-850e-9f26196da0e8","inputWidgets":{},"title":""}}},{"cell_type":"code","source":["patient_name = '21153'\n\nquery_part1 = f'MATCH (p:Patient)-[r1:IS_SYMPTOM]->(s:Symptom) WHERE p.name = {patient_name} '\nquery_part2 = '''\nWITH DISTINCT p.name as patients, r1.date as dates, COLLECT(DISTINCT s.name) as symptoms, COUNT(DISTINCT s.name) as num_symptoms\n\nMATCH (p:Patient)-[r2:IS_PROCEDURE]->(pr:Procedure)\nWHERE p.name=patients AND r2.date = dates\n\nWITH DISTINCT p.name as patients, r2.date as dates, COLLECT(DISTINCT pr.name) as procedures, COUNT(DISTINCT pr.name) as num_procedures, symptoms, num_symptoms\nMATCH (p:Patient)-[r3:IS_DSD]->(_d:DSD) \nWHERE p.name=patients AND r3.date = dates\n\nWITH DISTINCT p.name as patients, r3.date as dates, symptoms, num_symptoms, procedures, num_procedures,  COLLECT(DISTINCT _d.name) as dsds, COUNT(DISTINCT _d.name) as num_dsds\nMATCH (p:Patient)-[r4:IS_TEST]->(_t:Test) \nWHERE p.name=patients AND r4.date = dates\n\nWITH DISTINCT p.name as patients, r4.date as dates, symptoms, num_symptoms, procedures, num_procedures, dsds, num_dsds, COLLECT(_t.name) as tests, COUNT(_t.name) as num_tests\nMATCH (p:Patient)-[r5:RXNORM_CODE]->(rx:RxNorm)-[r6]->(_d:Drug)\nWHERE p.name=patients AND r5.date = dates\nRETURN DISTINCT p.name as patients, r5.date as dates, symptoms, num_symptoms, procedures, num_procedures, dsds, num_dsds, tests, num_tests, COLLECT(DISTINCT toLower(_d.name)) as drugs, COUNT(DISTINCT toLower(_d.name)) as num_drugs, COLLECT(DISTINCT rx.code) as rxnorms, COUNT(DISTINCT rx.code) as num_rxnorm\nORDER BY dates;\n'''\nquery_string = query_part1 + query_part2\ndf = pd.DataFrame([dict(_) for _ in conn.query(query_string)])\ndf"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"2faeaa34-6225-4d62-9ec5-8dd0683f8725","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Out[22]: </div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Out[22]: </div>"]}},{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>patients</th>\n      <th>dates</th>\n      <th>symptoms</th>\n      <th>num_symptoms</th>\n      <th>procedures</th>\n      <th>num_procedures</th>\n      <th>dsds</th>\n      <th>num_dsds</th>\n      <th>tests</th>\n      <th>num_tests</th>\n      <th>drugs</th>\n      <th>num_drugs</th>\n      <th>rxnorms</th>\n      <th>num_rxnorm</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>21153</td>\n      <td>2109-12-17</td>\n      <td>[pale, cough reflex, unresponsive, soft - soft...</td>\n      <td>18</td>\n      <td>[PT ALERT, thyraloglossal cyst removal, L [**4...</td>\n      <td>10</td>\n      <td>[ABG'S STABLE, cirrhosis, PAIN, allergies, MON...</td>\n      <td>8</td>\n      <td>[8p-7a, INR, LS CTA, INR REMAINS, POST PLT CT,...</td>\n      <td>20</td>\n      <td>[dex4, everolimus 2 mg tablet for oral suspens...</td>\n      <td>2</td>\n      <td>[607868, 1310138]</td>\n      <td>2</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>21153</td>\n      <td>2109-12-18</td>\n      <td>[slight abd pain, Weak gag, cough, decrease ag...</td>\n      <td>19</td>\n      <td>[PT ALERT, SM AMT SEROSANG DRG FROM INCISION, ...</td>\n      <td>7</td>\n      <td>[DSD, DIAMOX STARTED AS ORDERED, anxiety, PH D...</td>\n      <td>9</td>\n      <td>[PA, SvO2, 7p-7a, TCO2 DECEASED, magnesium, AB...</td>\n      <td>15</td>\n      <td>[crolom, clorsulon oral solution, insulin argi...</td>\n      <td>5</td>\n      <td>[216281, 1006411, 1740938, 1013644, 607868]</td>\n      <td>5</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>21153</td>\n      <td>2109-12-19</td>\n      <td>[abd pain, soft to soft distended abd, scant s...</td>\n      <td>25</td>\n      <td>[liver transplant, Anticipate extubation, Tole...</td>\n      <td>6</td>\n      <td>[Assit with pulmonary tiolett, metabolic alkal...</td>\n      <td>6</td>\n      <td>[Liver U/S, LS CTA, ABG's, RSBI-26, IVP, 7p-7a...</td>\n      <td>9</td>\n      <td>[clonidine 0.00833 mg/hr transdermal system, t...</td>\n      <td>6</td>\n      <td>[1360120, 220329, 151619, 1310821, 211372, 139...</td>\n      <td>6</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>21153</td>\n      <td>2109-12-20</td>\n      <td>[C/O SOB, N/V, SOB]</td>\n      <td>3</td>\n      <td>[MEDIAL JP WITH SM AMT SEROUS DRG, INCISION - ...</td>\n      <td>2</td>\n      <td>[LUNGS CTA BILAT, FAINT BS, ABG'S ACCEPTABLE, ...</td>\n      <td>5</td>\n      <td>[INCLUDING PLT CT, MIN SEROSANG DRG FROM, LS C...</td>\n      <td>5</td>\n      <td>[x-seb plus]</td>\n      <td>1</td>\n      <td>[220956]</td>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>21153</td>\n      <td>2109-12-21</td>\n      <td>[C/o abd pain, Pain, tender, serous drainage, ...</td>\n      <td>18</td>\n      <td>[bile drainage]</td>\n      <td>1</td>\n      <td>[RA, Hypertensive]</td>\n      <td>2</td>\n      <td>[HRR, K+, Hct, Mg++, Plt, FEN, cyclosporin lev...</td>\n      <td>8</td>\n      <td>[insulin lispro injectable solution]</td>\n      <td>1</td>\n      <td>[378841]</td>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>5</th>\n      <td>21153</td>\n      <td>2109-12-28</td>\n      <td>[JVD, nontender, acute\\ndistress, biliary duct...</td>\n      <td>15</td>\n      <td>[liver transplant, extubated, tonsillectomy, e...</td>\n      <td>7</td>\n      <td>[numerous spider nevi, chronic hepatitis\\nC, C...</td>\n      <td>9</td>\n      <td>[platelets, red blood cells, ALT, INR, lipase,...</td>\n      <td>32</td>\n      <td>[pantoprazole 40 mg, citalopram, docosanol top...</td>\n      <td>47</td>\n      <td>[330396, 2556, 855204, 351044, 317289, 1441735...</td>\n      <td>47</td>\n    </tr>\n    <tr>\n      <th>6</th>\n      <td>21153</td>\n      <td>2110-01-03</td>\n      <td>[opacification]</td>\n      <td>1</td>\n      <td>[liver transplant]</td>\n      <td>1</td>\n      <td>[ductal dilatation, stricture, LIVER TX,ABD PAIN]</td>\n      <td>3</td>\n      <td>[fluoroscopic\\n guidance, LFTs]</td>\n      <td>2</td>\n      <td>[slow trasicor, dibucaine]</td>\n      <td>2</td>\n      <td>[154995, 3339]</td>\n      <td>2</td>\n    </tr>\n    <tr>\n      <th>7</th>\n      <td>21153</td>\n      <td>2110-01-14</td>\n      <td>[decreased T-tube output, minimal intrahepatic...</td>\n      <td>11</td>\n      <td>[liver transplant, transplant liver]</td>\n      <td>2</td>\n      <td>[LIVER TRANSPLANT, abcess, segment VIII biliar...</td>\n      <td>6</td>\n      <td>[LFTs, color Doppler, TUBE CHOLANGIOGRAM, chol...</td>\n      <td>6</td>\n      <td>[lisinopril 20 mg oral tablet [carace]]</td>\n      <td>1</td>\n      <td>[201382]</td>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>8</th>\n      <td>21153</td>\n      <td>2110-01-19</td>\n      <td>[numerous splenorenal collaterals, Large subsc...</td>\n      <td>14</td>\n      <td>[PTC drain placement, percutaneous tube placem...</td>\n      <td>2</td>\n      <td>[biloma, ascites, LIVER TRANSPLANT, PTC PLACEM...</td>\n      <td>4</td>\n      <td>[CT 100CC, CT OF THE PELVIS WITH, CT OF, Contr...</td>\n      <td>5</td>\n      <td>[docusate sodium 100 mg [doculase], acalabruti...</td>\n      <td>4</td>\n      <td>[1302275, 1986815, 799044, 1592743]</td>\n      <td>4</td>\n    </tr>\n    <tr>\n      <th>9</th>\n      <td>21153</td>\n      <td>2110-01-28</td>\n      <td>[hepatic arterial\\n blood, diminished arterial...</td>\n      <td>15</td>\n      <td>[liver transplantation, hpatic artery anastamo...</td>\n      <td>8</td>\n      <td>[biloma, renal dysfunction, Large varices, LIV...</td>\n      <td>5</td>\n      <td>[delayed imaging, CAT scan, noncontrast scan, ...</td>\n      <td>14</td>\n      <td>[viravan s, docusate sodium 100 mg [doculase],...</td>\n      <td>5</td>\n      <td>[405398, 1302275, 574983, 105561, 1592743]</td>\n      <td>5</td>\n    </tr>\n    <tr>\n      <th>10</th>\n      <td>21153</td>\n      <td>2110-02-03</td>\n      <td>[specific diffuse bowel wall thickening, diffu...</td>\n      <td>11</td>\n      <td>[bile in JP\\n  drains, CT ABDOMEN W/O CONTRAST...</td>\n      <td>6</td>\n      <td>[minimal amount\\n of ascites, liver dysfunctio...</td>\n      <td>9</td>\n      <td>[CT PELVIS, Axial noncontrast CT imaging, CT O...</td>\n      <td>4</td>\n      <td>[ofev, cotab a]</td>\n      <td>2</td>\n      <td>[1592743, 799044]</td>\n      <td>2</td>\n    </tr>\n    <tr>\n      <th>11</th>\n      <td>21153</td>\n      <td>2110-02-06</td>\n      <td>[bile leak]</td>\n      <td>1</td>\n      <td>[hepatojejunostomy, core biopsy, Liver biopsy,...</td>\n      <td>7</td>\n      <td>[r/o rejection, LIVER TRANSPLANT]</td>\n      <td>2</td>\n      <td>[liver function\\n tests, ultrasound localizati...</td>\n      <td>3</td>\n      <td>[lidocaine 1 mg]</td>\n      <td>1</td>\n      <td>[439728]</td>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>12</th>\n      <td>21153</td>\n      <td>2110-02-21</td>\n      <td>[large leak, peripheral bile duct, wide anasto...</td>\n      <td>12</td>\n      <td>[ligation of duct leak, external drainage, PTH...</td>\n      <td>4</td>\n      <td>[strictures]</td>\n      <td>1</td>\n      <td>[ELEVATED LFTS\\n  Contrast, Tube cholangiogram...</td>\n      <td>6</td>\n      <td>[nonoxynol-9 100 mg [encare], dibucaine 10 mg/...</td>\n      <td>2</td>\n      <td>[884376, 309847]</td>\n      <td>2</td>\n    </tr>\n    <tr>\n      <th>13</th>\n      <td>21153</td>\n      <td>2110-02-24</td>\n      <td>[persistent leak, Persistent leak, leak, exten...</td>\n      <td>6</td>\n      <td>[liver transplant, hepaticojejunostomy, Replac...</td>\n      <td>4</td>\n      <td>[strictures]</td>\n      <td>1</td>\n      <td>[Tube cholangiogram]</td>\n      <td>1</td>\n      <td>[furosemide 50 mg [disal], polysulfated glycos...</td>\n      <td>2</td>\n      <td>[1546055, 1164478]</td>\n      <td>2</td>\n    </tr>\n    <tr>\n      <th>14</th>\n      <td>21153</td>\n      <td>2110-02-28</td>\n      <td>[mesenteric\\n fat stranding, significant\\n abd...</td>\n      <td>25</td>\n      <td>[bile in JP\\n  drains, placement tube nephrost...</td>\n      <td>10</td>\n      <td>[trace effusions, r/o abscess, abscess, trace\\...</td>\n      <td>5</td>\n      <td>[ELEVATED LFTS\\n  Contrast, CT of the abdomen ...</td>\n      <td>11</td>\n      <td>[caffeine 100 mg [no doz], dibucaine 1 mg, ofe...</td>\n      <td>4</td>\n      <td>[804995, 335534, 1592743, 1115005]</td>\n      <td>4</td>\n    </tr>\n    <tr>\n      <th>15</th>\n      <td>21153</td>\n      <td>2110-03-19</td>\n      <td>[vascular congestion, hazy appearance, moderat...</td>\n      <td>14</td>\n      <td>[liver transplant, POD 8 from\\n  bile anastomo...</td>\n      <td>4</td>\n      <td>[definite pneumonia, massive varices, Splenome...</td>\n      <td>9</td>\n      <td>[PA, ELEVATED LFTS\\n  Contrast, CT PELVIS, LAT...</td>\n      <td>6</td>\n      <td>[cotab a, ofev, nonathymulin]</td>\n      <td>3</td>\n      <td>[799044, 1592743, 1946823]</td>\n      <td>3</td>\n    </tr>\n    <tr>\n      <th>16</th>\n      <td>21153</td>\n      <td>2110-04-09</td>\n      <td>[bile leak, recurrent fluid\\n collections, lon...</td>\n      <td>20</td>\n      <td>[hepatojejunostomy, replacement of a post-pylo...</td>\n      <td>5</td>\n      <td>[clogged NGtube, failure to thrive, massive sp...</td>\n      <td>5</td>\n      <td>[CT PELVIS, fluoroscopic guidance, PELVIS CT, ...</td>\n      <td>6</td>\n      <td>[ofev, 24 hr ketoprofen 150 mg extended releas...</td>\n      <td>3</td>\n      <td>[1592743, 206981, 799044]</td>\n      <td>3</td>\n    </tr>\n    <tr>\n      <th>17</th>\n      <td>21153</td>\n      <td>2110-04-18</td>\n      <td>[large amount of post-operative fat stranding,...</td>\n      <td>24</td>\n      <td>[hepatojejunostomy, liver transplant c/b leak,...</td>\n      <td>11</td>\n      <td>[splenorenal shunt, Splenomegaly, massive sple...</td>\n      <td>5</td>\n      <td>[CT 150CC NONIONIC CONTRAST, cholangiograms, C...</td>\n      <td>13</td>\n      <td>[fentanyl, ofev, fentanyl sublingual tablet, f...</td>\n      <td>5</td>\n      <td>[4337, 1592743, 1053646, 329756, 1359673]</td>\n      <td>5</td>\n    </tr>\n    <tr>\n      <th>18</th>\n      <td>21153</td>\n      <td>2110-05-14</td>\n      <td>[biliary ductal dilatation, bile leak, bile\\n ...</td>\n      <td>9</td>\n      <td>[liver transplant, placement of 10 French Flex...</td>\n      <td>8</td>\n      <td>[biliary obstruction]</td>\n      <td>1</td>\n      <td>[Cholangiogram f\\n  Contrast, contrast study, ...</td>\n      <td>8</td>\n      <td>[loratadine 1 mg/ml oral solution, sunitinib 5...</td>\n      <td>3</td>\n      <td>[692783, 616291, 2265705]</td>\n      <td>3</td>\n    </tr>\n    <tr>\n      <th>19</th>\n      <td>21153</td>\n      <td>2110-06-03</td>\n      <td>[bleeding]</td>\n      <td>1</td>\n      <td>[Biopsy, liver transplant, recurrent Hep C)- t...</td>\n      <td>7</td>\n      <td>[infection, hepatitis C, rejection]</td>\n      <td>3</td>\n      <td>[ultrasound guidance, ultrasound observation, ...</td>\n      <td>3</td>\n      <td>[lidocaine 1 mg]</td>\n      <td>1</td>\n      <td>[439728]</td>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>20</th>\n      <td>21153</td>\n      <td>2110-06-13</td>\n      <td>[focal liver lesions, relative narrowing, sple...</td>\n      <td>11</td>\n      <td>[OLTx c/b biliary leak, liver transplant]</td>\n      <td>2</td>\n      <td>[large splenorenal shunt, Large splenorenal sh...</td>\n      <td>5</td>\n      <td>[Delayed images of the abdomen, PELVIS CT WITH...</td>\n      <td>8</td>\n      <td>[ofev, optigene, cotab a]</td>\n      <td>3</td>\n      <td>[1592743, 1101386, 799044]</td>\n      <td>3</td>\n    </tr>\n    <tr>\n      <th>21</th>\n      <td>21153</td>\n      <td>2110-06-28</td>\n      <td>[free air, fluid collection, free fluid, mesen...</td>\n      <td>13</td>\n      <td>[liver transplant, LIVER TX]</td>\n      <td>2</td>\n      <td>[varices, Few scattered diverticuli, abscess, ...</td>\n      <td>5</td>\n      <td>[CT PELVIS WITH IV CONTRAST, CT PELVIS, CT ABD...</td>\n      <td>4</td>\n      <td>[optigene, cotab a, nonoxynol-9 100 mg [encare...</td>\n      <td>4</td>\n      <td>[1101386, 799044, 884376, 1986815]</td>\n      <td>4</td>\n    </tr>\n    <tr>\n      <th>22</th>\n      <td>21153</td>\n      <td>2110-07-31</td>\n      <td>[fluid collection, bleed, shift of the\\n norma...</td>\n      <td>21</td>\n      <td>[liver transplant]</td>\n      <td>1</td>\n      <td>[fracture, LIVER TRANSPLANT, perisplenic varic...</td>\n      <td>16</td>\n      <td>[FINAL REPORT\\n HEAD CT, CT of the abdomen and...</td>\n      <td>8</td>\n      <td>[ofev, optigene, 24 hr ketoprofen 150 mg exten...</td>\n      <td>4</td>\n      <td>[1592743, 1101386, 206981, 799044]</td>\n      <td>4</td>\n    </tr>\n    <tr>\n      <th>23</th>\n      <td>21153</td>\n      <td>2110-09-04</td>\n      <td>[contiguous wall thickening, decompressed bili...</td>\n      <td>20</td>\n      <td>[abdominal\\n  pain, Liver transplant, liver tr...</td>\n      <td>7</td>\n      <td>[minimal pleural effusion, partial bowel obstr...</td>\n      <td>15</td>\n      <td>[CT, transhepataic cholangiogram, Free intra-a...</td>\n      <td>11</td>\n      <td>[estramustine 140 mg oral capsule [emcyt], ofe...</td>\n      <td>5</td>\n      <td>[205562, 1592743, 799044, 1101386, 899135]</td>\n      <td>5</td>\n    </tr>\n    <tr>\n      <th>24</th>\n      <td>21153</td>\n      <td>2110-09-05</td>\n      <td>[biliary leak, opacities, fluid collections, C...</td>\n      <td>14</td>\n      <td>[liver transplant, abdominal pain, Repositioni...</td>\n      <td>6</td>\n      <td>[small bowel obstruction, small\\n bowel obstru...</td>\n      <td>8</td>\n      <td>[scan for evaluation of contrast\\n throughput,...</td>\n      <td>5</td>\n      <td>[ofev]</td>\n      <td>1</td>\n      <td>[1592743]</td>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>25</th>\n      <td>21153</td>\n      <td>2110-09-09</td>\n      <td>[consolidation, basilar opacity, retrograde op...</td>\n      <td>8</td>\n      <td>[IJ central venous line\\n placement, explorato...</td>\n      <td>5</td>\n      <td>[sinus tachycardia, pneumothorax, pleural effu...</td>\n      <td>9</td>\n      <td>[ABDOMINAL PAIN\\n  Contrast, fluoroscopy, retr...</td>\n      <td>4</td>\n      <td>[lomustine 10 mg oral capsule [ccnu], isosorbi...</td>\n      <td>3</td>\n      <td>[105560, 153689, 828354]</td>\n      <td>3</td>\n    </tr>\n    <tr>\n      <th>26</th>\n      <td>21153</td>\n      <td>2110-09-15</td>\n      <td>[obstruction, consolidation, free fluid, scler...</td>\n      <td>7</td>\n      <td>[liver transplant]</td>\n      <td>1</td>\n      <td>[hep c cirrhosis, bile peritonitis, Multiple p...</td>\n      <td>8</td>\n      <td>[CT OF, CT OF THE PELVIS WITH, Contrast, CT 15...</td>\n      <td>7</td>\n      <td>[ofev, 24 hr ketoprofen 150 mg extended releas...</td>\n      <td>3</td>\n      <td>[1592743, 206981, 799044]</td>\n      <td>3</td>\n    </tr>\n    <tr>\n      <th>27</th>\n      <td>21153</td>\n      <td>2110-09-24</td>\n      <td>[leaking copious amounts of fluid, dilated, si...</td>\n      <td>5</td>\n      <td>[catheter exchange, Ttube, external bag draina...</td>\n      <td>6</td>\n      <td>[PTC]</td>\n      <td>1</td>\n      <td>[fluoroscopic spot image, tube cholangiograms,...</td>\n      <td>7</td>\n      <td>[10 ml sodium chloride 9 mg/ml injection, lido...</td>\n      <td>9</td>\n      <td>[1807637, 440800, 224913, 897697, 439728, 1055...</td>\n      <td>9</td>\n    </tr>\n    <tr>\n      <th>28</th>\n      <td>21153</td>\n      <td>2110-09-29</td>\n      <td>[free air, postsurgical stranding, small bowel...</td>\n      <td>9</td>\n      <td>[indwelling drains, liver transplant, Liver tr...</td>\n      <td>3</td>\n      <td>[Ileus, very large splenorenal varices, ileus,...</td>\n      <td>7</td>\n      <td>[38 Contrast, CT PELVIS, CT OF ABDOMEN WITHOUT...</td>\n      <td>10</td>\n      <td>[cotab a, docusate sodium 100 mg [doculase], a...</td>\n      <td>4</td>\n      <td>[799044, 1302275, 1986815, 1592743]</td>\n      <td>4</td>\n    </tr>\n    <tr>\n      <th>29</th>\n      <td>21153</td>\n      <td>2110-10-16</td>\n      <td>[cystic lesions, markedly\\n enlarged, lesion, ...</td>\n      <td>17</td>\n      <td>[multiplanar reconstruction, Multiplanar recon...</td>\n      <td>8</td>\n      <td>[protal vein thrombosis, stenosis of the ampul...</td>\n      <td>11</td>\n      <td>[MR RECONSTRUCTION IMAGING, imaging, ct las\\n ...</td>\n      <td>12</td>\n      <td>[gadolinium]</td>\n      <td>1</td>\n      <td>[1310171]</td>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>30</th>\n      <td>21153</td>\n      <td>2110-10-20</td>\n      <td>[peritoneal fluid collection, large collateral...</td>\n      <td>14</td>\n      <td>[liver transplant, CT\\n guided aspiration]</td>\n      <td>2</td>\n      <td>[small amount of ascites, Continued small amou...</td>\n      <td>9</td>\n      <td>[cultures, CT, culture, CT fluoroscopy, CT PEL...</td>\n      <td>12</td>\n      <td>[dibucaine 1 mg, 24 hr ketoprofen 150 mg exten...</td>\n      <td>4</td>\n      <td>[335534, 206981, 799044, 1592743]</td>\n      <td>4</td>\n    </tr>\n  </tbody>\n</table>\n</div>","textData":null,"removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"htmlSandbox","arguments":{}}},"output_type":"display_data","data":{"text/html":["<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>patients</th>\n      <th>dates</th>\n      <th>symptoms</th>\n      <th>num_symptoms</th>\n      <th>procedures</th>\n      <th>num_procedures</th>\n      <th>dsds</th>\n      <th>num_dsds</th>\n      <th>tests</th>\n      <th>num_tests</th>\n      <th>drugs</th>\n      <th>num_drugs</th>\n      <th>rxnorms</th>\n      <th>num_rxnorm</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>21153</td>\n      <td>2109-12-17</td>\n      <td>[pale, cough reflex, unresponsive, soft - soft...</td>\n      <td>18</td>\n      <td>[PT ALERT, thyraloglossal cyst removal, L [**4...</td>\n      <td>10</td>\n      <td>[ABG'S STABLE, cirrhosis, PAIN, allergies, MON...</td>\n      <td>8</td>\n      <td>[8p-7a, INR, LS CTA, INR REMAINS, POST PLT CT,...</td>\n      <td>20</td>\n      <td>[dex4, everolimus 2 mg tablet for oral suspens...</td>\n      <td>2</td>\n      <td>[607868, 1310138]</td>\n      <td>2</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>21153</td>\n      <td>2109-12-18</td>\n      <td>[slight abd pain, Weak gag, cough, decrease ag...</td>\n      <td>19</td>\n      <td>[PT ALERT, SM AMT SEROSANG DRG FROM INCISION, ...</td>\n      <td>7</td>\n      <td>[DSD, DIAMOX STARTED AS ORDERED, anxiety, PH D...</td>\n      <td>9</td>\n      <td>[PA, SvO2, 7p-7a, TCO2 DECEASED, magnesium, AB...</td>\n      <td>15</td>\n      <td>[crolom, clorsulon oral solution, insulin argi...</td>\n      <td>5</td>\n      <td>[216281, 1006411, 1740938, 1013644, 607868]</td>\n      <td>5</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>21153</td>\n      <td>2109-12-19</td>\n      <td>[abd pain, soft to soft distended abd, scant s...</td>\n      <td>25</td>\n      <td>[liver transplant, Anticipate extubation, Tole...</td>\n      <td>6</td>\n      <td>[Assit with pulmonary tiolett, metabolic alkal...</td>\n      <td>6</td>\n      <td>[Liver U/S, LS CTA, ABG's, RSBI-26, IVP, 7p-7a...</td>\n      <td>9</td>\n      <td>[clonidine 0.00833 mg/hr transdermal system, t...</td>\n      <td>6</td>\n      <td>[1360120, 220329, 151619, 1310821, 211372, 139...</td>\n      <td>6</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>21153</td>\n      <td>2109-12-20</td>\n      <td>[C/O SOB, N/V, SOB]</td>\n      <td>3</td>\n      <td>[MEDIAL JP WITH SM AMT SEROUS DRG, INCISION - ...</td>\n      <td>2</td>\n      <td>[LUNGS CTA BILAT, FAINT BS, ABG'S ACCEPTABLE, ...</td>\n      <td>5</td>\n      <td>[INCLUDING PLT CT, MIN SEROSANG DRG FROM, LS C...</td>\n      <td>5</td>\n      <td>[x-seb plus]</td>\n      <td>1</td>\n      <td>[220956]</td>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>21153</td>\n      <td>2109-12-21</td>\n      <td>[C/o abd pain, Pain, tender, serous drainage, ...</td>\n      <td>18</td>\n      <td>[bile drainage]</td>\n      <td>1</td>\n      <td>[RA, Hypertensive]</td>\n      <td>2</td>\n      <td>[HRR, K+, Hct, Mg++, Plt, FEN, cyclosporin lev...</td>\n      <td>8</td>\n      <td>[insulin lispro injectable solution]</td>\n      <td>1</td>\n      <td>[378841]</td>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>5</th>\n      <td>21153</td>\n      <td>2109-12-28</td>\n      <td>[JVD, nontender, acute\\ndistress, biliary duct...</td>\n      <td>15</td>\n      <td>[liver transplant, extubated, tonsillectomy, e...</td>\n      <td>7</td>\n      <td>[numerous spider nevi, chronic hepatitis\\nC, C...</td>\n      <td>9</td>\n      <td>[platelets, red blood cells, ALT, INR, lipase,...</td>\n      <td>32</td>\n      <td>[pantoprazole 40 mg, citalopram, docosanol top...</td>\n      <td>47</td>\n      <td>[330396, 2556, 855204, 351044, 317289, 1441735...</td>\n      <td>47</td>\n    </tr>\n    <tr>\n      <th>6</th>\n      <td>21153</td>\n      <td>2110-01-03</td>\n      <td>[opacification]</td>\n      <td>1</td>\n      <td>[liver transplant]</td>\n      <td>1</td>\n      <td>[ductal dilatation, stricture, LIVER TX,ABD PAIN]</td>\n      <td>3</td>\n      <td>[fluoroscopic\\n guidance, LFTs]</td>\n      <td>2</td>\n      <td>[slow trasicor, dibucaine]</td>\n      <td>2</td>\n      <td>[154995, 3339]</td>\n      <td>2</td>\n    </tr>\n    <tr>\n      <th>7</th>\n      <td>21153</td>\n      <td>2110-01-14</td>\n      <td>[decreased T-tube output, minimal intrahepatic...</td>\n      <td>11</td>\n      <td>[liver transplant, transplant liver]</td>\n      <td>2</td>\n      <td>[LIVER TRANSPLANT, abcess, segment VIII biliar...</td>\n      <td>6</td>\n      <td>[LFTs, color Doppler, TUBE CHOLANGIOGRAM, chol...</td>\n      <td>6</td>\n      <td>[lisinopril 20 mg oral tablet [carace]]</td>\n      <td>1</td>\n      <td>[201382]</td>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>8</th>\n      <td>21153</td>\n      <td>2110-01-19</td>\n      <td>[numerous splenorenal collaterals, Large subsc...</td>\n      <td>14</td>\n      <td>[PTC drain placement, percutaneous tube placem...</td>\n      <td>2</td>\n      <td>[biloma, ascites, LIVER TRANSPLANT, PTC PLACEM...</td>\n      <td>4</td>\n      <td>[CT 100CC, CT OF THE PELVIS WITH, CT OF, Contr...</td>\n      <td>5</td>\n      <td>[docusate sodium 100 mg [doculase], acalabruti...</td>\n      <td>4</td>\n      <td>[1302275, 1986815, 799044, 1592743]</td>\n      <td>4</td>\n    </tr>\n    <tr>\n      <th>9</th>\n      <td>21153</td>\n      <td>2110-01-28</td>\n      <td>[hepatic arterial\\n blood, diminished arterial...</td>\n      <td>15</td>\n      <td>[liver transplantation, hpatic artery anastamo...</td>\n      <td>8</td>\n      <td>[biloma, renal dysfunction, Large varices, LIV...</td>\n      <td>5</td>\n      <td>[delayed imaging, CAT scan, noncontrast scan, ...</td>\n      <td>14</td>\n      <td>[viravan s, docusate sodium 100 mg [doculase],...</td>\n      <td>5</td>\n      <td>[405398, 1302275, 574983, 105561, 1592743]</td>\n      <td>5</td>\n    </tr>\n    <tr>\n      <th>10</th>\n      <td>21153</td>\n      <td>2110-02-03</td>\n      <td>[specific diffuse bowel wall thickening, diffu...</td>\n      <td>11</td>\n      <td>[bile in JP\\n  drains, CT ABDOMEN W/O CONTRAST...</td>\n      <td>6</td>\n      <td>[minimal amount\\n of ascites, liver dysfunctio...</td>\n      <td>9</td>\n      <td>[CT PELVIS, Axial noncontrast CT imaging, CT O...</td>\n      <td>4</td>\n      <td>[ofev, cotab a]</td>\n      <td>2</td>\n      <td>[1592743, 799044]</td>\n      <td>2</td>\n    </tr>\n    <tr>\n      <th>11</th>\n      <td>21153</td>\n      <td>2110-02-06</td>\n      <td>[bile leak]</td>\n      <td>1</td>\n      <td>[hepatojejunostomy, core biopsy, Liver biopsy,...</td>\n      <td>7</td>\n      <td>[r/o rejection, LIVER TRANSPLANT]</td>\n      <td>2</td>\n      <td>[liver function\\n tests, ultrasound localizati...</td>\n      <td>3</td>\n      <td>[lidocaine 1 mg]</td>\n      <td>1</td>\n      <td>[439728]</td>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>12</th>\n      <td>21153</td>\n      <td>2110-02-21</td>\n      <td>[large leak, peripheral bile duct, wide anasto...</td>\n      <td>12</td>\n      <td>[ligation of duct leak, external drainage, PTH...</td>\n      <td>4</td>\n      <td>[strictures]</td>\n      <td>1</td>\n      <td>[ELEVATED LFTS\\n  Contrast, Tube cholangiogram...</td>\n      <td>6</td>\n      <td>[nonoxynol-9 100 mg [encare], dibucaine 10 mg/...</td>\n      <td>2</td>\n      <td>[884376, 309847]</td>\n      <td>2</td>\n    </tr>\n    <tr>\n      <th>13</th>\n      <td>21153</td>\n      <td>2110-02-24</td>\n      <td>[persistent leak, Persistent leak, leak, exten...</td>\n      <td>6</td>\n      <td>[liver transplant, hepaticojejunostomy, Replac...</td>\n      <td>4</td>\n      <td>[strictures]</td>\n      <td>1</td>\n      <td>[Tube cholangiogram]</td>\n      <td>1</td>\n      <td>[furosemide 50 mg [disal], polysulfated glycos...</td>\n      <td>2</td>\n      <td>[1546055, 1164478]</td>\n      <td>2</td>\n    </tr>\n    <tr>\n      <th>14</th>\n      <td>21153</td>\n      <td>2110-02-28</td>\n      <td>[mesenteric\\n fat stranding, significant\\n abd...</td>\n      <td>25</td>\n      <td>[bile in JP\\n  drains, placement tube nephrost...</td>\n      <td>10</td>\n      <td>[trace effusions, r/o abscess, abscess, trace\\...</td>\n      <td>5</td>\n      <td>[ELEVATED LFTS\\n  Contrast, CT of the abdomen ...</td>\n      <td>11</td>\n      <td>[caffeine 100 mg [no doz], dibucaine 1 mg, ofe...</td>\n      <td>4</td>\n      <td>[804995, 335534, 1592743, 1115005]</td>\n      <td>4</td>\n    </tr>\n    <tr>\n      <th>15</th>\n      <td>21153</td>\n      <td>2110-03-19</td>\n      <td>[vascular congestion, hazy appearance, moderat...</td>\n      <td>14</td>\n      <td>[liver transplant, POD 8 from\\n  bile anastomo...</td>\n      <td>4</td>\n      <td>[definite pneumonia, massive varices, Splenome...</td>\n      <td>9</td>\n      <td>[PA, ELEVATED LFTS\\n  Contrast, CT PELVIS, LAT...</td>\n      <td>6</td>\n      <td>[cotab a, ofev, nonathymulin]</td>\n      <td>3</td>\n      <td>[799044, 1592743, 1946823]</td>\n      <td>3</td>\n    </tr>\n    <tr>\n      <th>16</th>\n      <td>21153</td>\n      <td>2110-04-09</td>\n      <td>[bile leak, recurrent fluid\\n collections, lon...</td>\n      <td>20</td>\n      <td>[hepatojejunostomy, replacement of a post-pylo...</td>\n      <td>5</td>\n      <td>[clogged NGtube, failure to thrive, massive sp...</td>\n      <td>5</td>\n      <td>[CT PELVIS, fluoroscopic guidance, PELVIS CT, ...</td>\n      <td>6</td>\n      <td>[ofev, 24 hr ketoprofen 150 mg extended releas...</td>\n      <td>3</td>\n      <td>[1592743, 206981, 799044]</td>\n      <td>3</td>\n    </tr>\n    <tr>\n      <th>17</th>\n      <td>21153</td>\n      <td>2110-04-18</td>\n      <td>[large amount of post-operative fat stranding,...</td>\n      <td>24</td>\n      <td>[hepatojejunostomy, liver transplant c/b leak,...</td>\n      <td>11</td>\n      <td>[splenorenal shunt, Splenomegaly, massive sple...</td>\n      <td>5</td>\n      <td>[CT 150CC NONIONIC CONTRAST, cholangiograms, C...</td>\n      <td>13</td>\n      <td>[fentanyl, ofev, fentanyl sublingual tablet, f...</td>\n      <td>5</td>\n      <td>[4337, 1592743, 1053646, 329756, 1359673]</td>\n      <td>5</td>\n    </tr>\n    <tr>\n      <th>18</th>\n      <td>21153</td>\n      <td>2110-05-14</td>\n      <td>[biliary ductal dilatation, bile leak, bile\\n ...</td>\n      <td>9</td>\n      <td>[liver transplant, placement of 10 French Flex...</td>\n      <td>8</td>\n      <td>[biliary obstruction]</td>\n      <td>1</td>\n      <td>[Cholangiogram f\\n  Contrast, contrast study, ...</td>\n      <td>8</td>\n      <td>[loratadine 1 mg/ml oral solution, sunitinib 5...</td>\n      <td>3</td>\n      <td>[692783, 616291, 2265705]</td>\n      <td>3</td>\n    </tr>\n    <tr>\n      <th>19</th>\n      <td>21153</td>\n      <td>2110-06-03</td>\n      <td>[bleeding]</td>\n      <td>1</td>\n      <td>[Biopsy, liver transplant, recurrent Hep C)- t...</td>\n      <td>7</td>\n      <td>[infection, hepatitis C, rejection]</td>\n      <td>3</td>\n      <td>[ultrasound guidance, ultrasound observation, ...</td>\n      <td>3</td>\n      <td>[lidocaine 1 mg]</td>\n      <td>1</td>\n      <td>[439728]</td>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>20</th>\n      <td>21153</td>\n      <td>2110-06-13</td>\n      <td>[focal liver lesions, relative narrowing, sple...</td>\n      <td>11</td>\n      <td>[OLTx c/b biliary leak, liver transplant]</td>\n      <td>2</td>\n      <td>[large splenorenal shunt, Large splenorenal sh...</td>\n      <td>5</td>\n      <td>[Delayed images of the abdomen, PELVIS CT WITH...</td>\n      <td>8</td>\n      <td>[ofev, optigene, cotab a]</td>\n      <td>3</td>\n      <td>[1592743, 1101386, 799044]</td>\n      <td>3</td>\n    </tr>\n    <tr>\n      <th>21</th>\n      <td>21153</td>\n      <td>2110-06-28</td>\n      <td>[free air, fluid collection, free fluid, mesen...</td>\n      <td>13</td>\n      <td>[liver transplant, LIVER TX]</td>\n      <td>2</td>\n      <td>[varices, Few scattered diverticuli, abscess, ...</td>\n      <td>5</td>\n      <td>[CT PELVIS WITH IV CONTRAST, CT PELVIS, CT ABD...</td>\n      <td>4</td>\n      <td>[optigene, cotab a, nonoxynol-9 100 mg [encare...</td>\n      <td>4</td>\n      <td>[1101386, 799044, 884376, 1986815]</td>\n      <td>4</td>\n    </tr>\n    <tr>\n      <th>22</th>\n      <td>21153</td>\n      <td>2110-07-31</td>\n      <td>[fluid collection, bleed, shift of the\\n norma...</td>\n      <td>21</td>\n      <td>[liver transplant]</td>\n      <td>1</td>\n      <td>[fracture, LIVER TRANSPLANT, perisplenic varic...</td>\n      <td>16</td>\n      <td>[FINAL REPORT\\n HEAD CT, CT of the abdomen and...</td>\n      <td>8</td>\n      <td>[ofev, optigene, 24 hr ketoprofen 150 mg exten...</td>\n      <td>4</td>\n      <td>[1592743, 1101386, 206981, 799044]</td>\n      <td>4</td>\n    </tr>\n    <tr>\n      <th>23</th>\n      <td>21153</td>\n      <td>2110-09-04</td>\n      <td>[contiguous wall thickening, decompressed bili...</td>\n      <td>20</td>\n      <td>[abdominal\\n  pain, Liver transplant, liver tr...</td>\n      <td>7</td>\n      <td>[minimal pleural effusion, partial bowel obstr...</td>\n      <td>15</td>\n      <td>[CT, transhepataic cholangiogram, Free intra-a...</td>\n      <td>11</td>\n      <td>[estramustine 140 mg oral capsule [emcyt], ofe...</td>\n      <td>5</td>\n      <td>[205562, 1592743, 799044, 1101386, 899135]</td>\n      <td>5</td>\n    </tr>\n    <tr>\n      <th>24</th>\n      <td>21153</td>\n      <td>2110-09-05</td>\n      <td>[biliary leak, opacities, fluid collections, C...</td>\n      <td>14</td>\n      <td>[liver transplant, abdominal pain, Repositioni...</td>\n      <td>6</td>\n      <td>[small bowel obstruction, small\\n bowel obstru...</td>\n      <td>8</td>\n      <td>[scan for evaluation of contrast\\n throughput,...</td>\n      <td>5</td>\n      <td>[ofev]</td>\n      <td>1</td>\n      <td>[1592743]</td>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>25</th>\n      <td>21153</td>\n      <td>2110-09-09</td>\n      <td>[consolidation, basilar opacity, retrograde op...</td>\n      <td>8</td>\n      <td>[IJ central venous line\\n placement, explorato...</td>\n      <td>5</td>\n      <td>[sinus tachycardia, pneumothorax, pleural effu...</td>\n      <td>9</td>\n      <td>[ABDOMINAL PAIN\\n  Contrast, fluoroscopy, retr...</td>\n      <td>4</td>\n      <td>[lomustine 10 mg oral capsule [ccnu], isosorbi...</td>\n      <td>3</td>\n      <td>[105560, 153689, 828354]</td>\n      <td>3</td>\n    </tr>\n    <tr>\n      <th>26</th>\n      <td>21153</td>\n      <td>2110-09-15</td>\n      <td>[obstruction, consolidation, free fluid, scler...</td>\n      <td>7</td>\n      <td>[liver transplant]</td>\n      <td>1</td>\n      <td>[hep c cirrhosis, bile peritonitis, Multiple p...</td>\n      <td>8</td>\n      <td>[CT OF, CT OF THE PELVIS WITH, Contrast, CT 15...</td>\n      <td>7</td>\n      <td>[ofev, 24 hr ketoprofen 150 mg extended releas...</td>\n      <td>3</td>\n      <td>[1592743, 206981, 799044]</td>\n      <td>3</td>\n    </tr>\n    <tr>\n      <th>27</th>\n      <td>21153</td>\n      <td>2110-09-24</td>\n      <td>[leaking copious amounts of fluid, dilated, si...</td>\n      <td>5</td>\n      <td>[catheter exchange, Ttube, external bag draina...</td>\n      <td>6</td>\n      <td>[PTC]</td>\n      <td>1</td>\n      <td>[fluoroscopic spot image, tube cholangiograms,...</td>\n      <td>7</td>\n      <td>[10 ml sodium chloride 9 mg/ml injection, lido...</td>\n      <td>9</td>\n      <td>[1807637, 440800, 224913, 897697, 439728, 1055...</td>\n      <td>9</td>\n    </tr>\n    <tr>\n      <th>28</th>\n      <td>21153</td>\n      <td>2110-09-29</td>\n      <td>[free air, postsurgical stranding, small bowel...</td>\n      <td>9</td>\n      <td>[indwelling drains, liver transplant, Liver tr...</td>\n      <td>3</td>\n      <td>[Ileus, very large splenorenal varices, ileus,...</td>\n      <td>7</td>\n      <td>[38 Contrast, CT PELVIS, CT OF ABDOMEN WITHOUT...</td>\n      <td>10</td>\n      <td>[cotab a, docusate sodium 100 mg [doculase], a...</td>\n      <td>4</td>\n      <td>[799044, 1302275, 1986815, 1592743]</td>\n      <td>4</td>\n    </tr>\n    <tr>\n      <th>29</th>\n      <td>21153</td>\n      <td>2110-10-16</td>\n      <td>[cystic lesions, markedly\\n enlarged, lesion, ...</td>\n      <td>17</td>\n      <td>[multiplanar reconstruction, Multiplanar recon...</td>\n      <td>8</td>\n      <td>[protal vein thrombosis, stenosis of the ampul...</td>\n      <td>11</td>\n      <td>[MR RECONSTRUCTION IMAGING, imaging, ct las\\n ...</td>\n      <td>12</td>\n      <td>[gadolinium]</td>\n      <td>1</td>\n      <td>[1310171]</td>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>30</th>\n      <td>21153</td>\n      <td>2110-10-20</td>\n      <td>[peritoneal fluid collection, large collateral...</td>\n      <td>14</td>\n      <td>[liver transplant, CT\\n guided aspiration]</td>\n      <td>2</td>\n      <td>[small amount of ascites, Continued small amou...</td>\n      <td>9</td>\n      <td>[cultures, CT, culture, CT fluoroscopy, CT PEL...</td>\n      <td>12</td>\n      <td>[dibucaine 1 mg, 24 hr ketoprofen 150 mg exten...</td>\n      <td>4</td>\n      <td>[335534, 206981, 799044, 1592743]</td>\n      <td>4</td>\n    </tr>\n  </tbody>\n</table>\n</div>"]}}],"execution_count":0},{"cell_type":"code","source":["# To get the following visualization, run the query in the Neo4j Browser\n\nquery_string = '''\n  MATCH (p:Patient)\n  WHERE p.name = 21153\n\n  CALL apoc.path.subgraphAll(p, {\n      relationshipFilter: \"RXNORM_CODE>|DRUG_GENERIC\",\n                minLevel: 0,\n                maxLevel: 3\n                })\n   YIELD nodes, relationships\n   RETURN nodes, relationships;\n   '''"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"79921646-5663-468c-a1b2-b45f0b21aa2f","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\"></div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\"></div>"]}}],"execution_count":0},{"cell_type":"markdown","source":["<img src=\"https://raw.githubusercontent.com/iamvarol/blogposts/main/databricks/images/patients_journey.png\">"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"648e07da-a083-452e-899f-22ba0a262830","inputWidgets":{},"title":""}}},{"cell_type":"markdown","source":["**which patient used isosorbide:**"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"2ef4ed46-73f5-4560-8947-655933732d8a","inputWidgets":{},"title":""}}},{"cell_type":"code","source":["# drug based query\ndrug_generic_name = 'isosorbide' \n\nquery_part1 = 'MATCH (p:Patient)-[rel_rx]->(rx:RxNorm)-[rel_d]->(d:Drug)-[rel_n]->(n:NER) '\nquery_part2 = f'WHERE d.name CONTAINS \"{drug_generic_name}\" AND rel_n.date=rel_rx.date AND rel_n.patient_name=p.name '\nquery_part3 = '''RETURN DISTINCT\n                 d.name as drug_generic_name, \n                 p.name as patient_name, \n                 rel_rx.date as date, \n                 rx.code as rxnorm_code, \n                 COALESCE(n.name,'') +  \"(\" + COALESCE (type(rel_n), \"\") + \")\" as details'''\n\nquery_string = query_part1 + query_part2 + query_part3\ndf = pd.DataFrame([dict(_) for _ in conn.query(query_string)])\ndf = df.groupby(['patient_name', 'date', 'rxnorm_code','drug_generic_name']).agg(lambda x : ' '.join(x)).reset_index()\ndf"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"844c2603-d73d-4526-9318-cbf49527ab20","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Out[24]: </div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Out[24]: </div>"]}},{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>patient_name</th>\n      <th>date</th>\n      <th>rxnorm_code</th>\n      <th>drug_generic_name</th>\n      <th>details</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>12200</td>\n      <td>2136-06-20</td>\n      <td>153689</td>\n      <td>isosorbide dinitrate 30 mg oral spray [isocard]</td>\n      <td>piv(DRUG) 30cc/kg(STRENGTH)</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>19823</td>\n      <td>2167-12-01</td>\n      <td>201438</td>\n      <td>isosorbide mononitrate 60 mg extended release ...</td>\n      <td>po(ROUTE) x1(FREQUENCY) 60meq(DRUG)</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>19823</td>\n      <td>2172-06-20</td>\n      <td>201415</td>\n      <td>isosorbide dinitrate 5 mg sublingual tablet [i...</td>\n      <td>5 mg(STRENGTH) medicated(DRUG)</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>21153</td>\n      <td>2110-09-09</td>\n      <td>153689</td>\n      <td>isosorbide dinitrate 30 mg oral spray [isocard]</td>\n      <td>contrast(DRUG) 30 cc(DOSAGE)</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>22015</td>\n      <td>2161-05-05</td>\n      <td>153689</td>\n      <td>isosorbide dinitrate 30 mg oral spray [isocard]</td>\n      <td>kphos(DRUG) 30 meq(STRENGTH)</td>\n    </tr>\n    <tr>\n      <th>5</th>\n      <td>28552</td>\n      <td>2122-07-17</td>\n      <td>721832</td>\n      <td>hydralazine / isosorbide dinitrate oral tablet</td>\n      <td>iv(ROUTE) ntg,iv hydralazine(DRUG)</td>\n    </tr>\n  </tbody>\n</table>\n</div>","textData":null,"removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"htmlSandbox","arguments":{}}},"output_type":"display_data","data":{"text/html":["<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>patient_name</th>\n      <th>date</th>\n      <th>rxnorm_code</th>\n      <th>drug_generic_name</th>\n      <th>details</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>12200</td>\n      <td>2136-06-20</td>\n      <td>153689</td>\n      <td>isosorbide dinitrate 30 mg oral spray [isocard]</td>\n      <td>piv(DRUG) 30cc/kg(STRENGTH)</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>19823</td>\n      <td>2167-12-01</td>\n      <td>201438</td>\n      <td>isosorbide mononitrate 60 mg extended release ...</td>\n      <td>po(ROUTE) x1(FREQUENCY) 60meq(DRUG)</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>19823</td>\n      <td>2172-06-20</td>\n      <td>201415</td>\n      <td>isosorbide dinitrate 5 mg sublingual tablet [i...</td>\n      <td>5 mg(STRENGTH) medicated(DRUG)</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>21153</td>\n      <td>2110-09-09</td>\n      <td>153689</td>\n      <td>isosorbide dinitrate 30 mg oral spray [isocard]</td>\n      <td>contrast(DRUG) 30 cc(DOSAGE)</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>22015</td>\n      <td>2161-05-05</td>\n      <td>153689</td>\n      <td>isosorbide dinitrate 30 mg oral spray [isocard]</td>\n      <td>kphos(DRUG) 30 meq(STRENGTH)</td>\n    </tr>\n    <tr>\n      <th>5</th>\n      <td>28552</td>\n      <td>2122-07-17</td>\n      <td>721832</td>\n      <td>hydralazine / isosorbide dinitrate oral tablet</td>\n      <td>iv(ROUTE) ntg,iv hydralazine(DRUG)</td>\n    </tr>\n  </tbody>\n</table>\n</div>"]}}],"execution_count":0},{"cell_type":"markdown","source":["**patients who are prescribed Lasix between May 2060 and May 2125:**"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"1d7adff4-faf7-4378-b090-d93106c8097a","inputWidgets":{},"title":""}}},{"cell_type":"code","source":["query_string ='''\nMATCH (p:Patient)-[rel_rx]->(rx:RxNorm)-[rel_d]->(d:Drug)-[rel_n:DRUG]->(n:NER)\nWHERE d.name IN ['lasix']\n      AND rel_n.patient_name=p.name\n      AND rel_n.date=rel_rx.date \n      AND rel_rx.date >= date(\"2060-05-01\")\n      AND rel_n.date >= date(\"2060-05-01\")\n      AND rel_rx.date < date(\"2125-05-01\")\n      AND rel_n.date < date(\"2125-05-01\")\nRETURN DISTINCT\n      d.name as drug_generic_name, \n      p.name as patient_name, \n      rel_rx.date as date\nORDER BY date ASC\n'''\n\ndf = pd.DataFrame([dict(_) for _ in conn.query(query_string)])\ndf"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"215b185e-1042-40e0-abbb-87775c3eeda4","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Out[25]: </div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Out[25]: </div>"]}},{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>drug_generic_name</th>\n      <th>patient_name</th>\n      <th>date</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>lasix</td>\n      <td>28552</td>\n      <td>2122-07-17</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>lasix</td>\n      <td>28552</td>\n      <td>2122-07-18</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>lasix</td>\n      <td>28552</td>\n      <td>2122-07-20</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>lasix</td>\n      <td>28552</td>\n      <td>2122-07-21</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>lasix</td>\n      <td>28552</td>\n      <td>2122-07-22</td>\n    </tr>\n    <tr>\n      <th>5</th>\n      <td>lasix</td>\n      <td>28552</td>\n      <td>2122-07-24</td>\n    </tr>\n    <tr>\n      <th>6</th>\n      <td>lasix</td>\n      <td>28552</td>\n      <td>2122-07-29</td>\n    </tr>\n  </tbody>\n</table>\n</div>","textData":null,"removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"htmlSandbox","arguments":{}}},"output_type":"display_data","data":{"text/html":["<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>drug_generic_name</th>\n      <th>patient_name</th>\n      <th>date</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>lasix</td>\n      <td>28552</td>\n      <td>2122-07-17</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>lasix</td>\n      <td>28552</td>\n      <td>2122-07-18</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>lasix</td>\n      <td>28552</td>\n      <td>2122-07-20</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>lasix</td>\n      <td>28552</td>\n      <td>2122-07-21</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>lasix</td>\n      <td>28552</td>\n      <td>2122-07-22</td>\n    </tr>\n    <tr>\n      <th>5</th>\n      <td>lasix</td>\n      <td>28552</td>\n      <td>2122-07-24</td>\n    </tr>\n    <tr>\n      <th>6</th>\n      <td>lasix</td>\n      <td>28552</td>\n      <td>2122-07-29</td>\n    </tr>\n  </tbody>\n</table>\n</div>"]}}],"execution_count":0},{"cell_type":"code","source":["# To obtain the visualization below run the query in Neo4j Browser:\n\nquery_string = '''\n  MATCH (p:Patient)-[rel_rx]->(rx:RxNorm)-[rel_d]->(d:Drug)-[rel_n:DRUG]->(n:NER)\n  WHERE d.name IN ['lasix']\n      AND rel_n.patient_name=p.name\n      AND rel_n.date=rel_rx.date \n      AND rel_rx.date >= date(\"2060-05-01\")\n      AND rel_n.date >= date(\"2060-05-01\")\n      AND rel_rx.date < date(\"2125-05-01\")\n      AND rel_n.date < date(\"2125-05-01\")\n  RETURN d, rel_rx, rx, rel_d, rel_n, p, n;\n  '''"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"eac50cc7-f9d3-4921-8e1c-4f090e3e55e0","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\"></div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\"></div>"]}}],"execution_count":0},{"cell_type":"markdown","source":["<img src=\"https://raw.githubusercontent.com/iamvarol/blogposts/main/databricks/images/lasix.png\">"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"5dcbeed2-b5a9-4312-bc3a-70d049e44730","inputWidgets":{},"title":""}}},{"cell_type":"markdown","source":["**patients using warfarin 2mg and up:**"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"dc3dc89a-87d7-434b-846b-b110af458e57","inputWidgets":{},"title":""}}},{"cell_type":"code","source":["query_string ='''\nMATCH (p:Patient)-[rel_rx]->(rx:RxNorm)-[rel_d]->(d:Drug)-[rel_n:STRENGTH]->(n:NER)\nWHERE toLower(d.name) CONTAINS 'warfarin'\n      AND rel_n.patient_name=p.name\n      AND rel_n.date=rel_rx.date \n      AND toInteger(left(n.name,1)) >=2\nRETURN  DISTINCT\n      d.name as drug_generic_name,\n      rx.code as rxnorm_code,\n      p.name as patient_name,\n      n.name as strength,\n      rel_rx.date as date\n'''\ndf = pd.DataFrame([dict(_) for _ in conn.query(query_string)])\ndf"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"1769f098-ba71-4ca4-87e5-ad5b441327e5","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Out[27]: </div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Out[27]: </div>"]}},{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>drug_generic_name</th>\n      <th>rxnorm_code</th>\n      <th>patient_name</th>\n      <th>strength</th>\n      <th>date</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>warfarin sodium 2.5 mg [coumadin]</td>\n      <td>855313</td>\n      <td>19823</td>\n      <td>2.5 mg</td>\n      <td>2167-11-27</td>\n    </tr>\n  </tbody>\n</table>\n</div>","textData":null,"removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"htmlSandbox","arguments":{}}},"output_type":"display_data","data":{"text/html":["<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>drug_generic_name</th>\n      <th>rxnorm_code</th>\n      <th>patient_name</th>\n      <th>strength</th>\n      <th>date</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>warfarin sodium 2.5 mg [coumadin]</td>\n      <td>855313</td>\n      <td>19823</td>\n      <td>2.5 mg</td>\n      <td>2167-11-27</td>\n    </tr>\n  </tbody>\n</table>\n</div>"]}}],"execution_count":0},{"cell_type":"markdown","source":["**dangerous drug combinations:**"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"36285e91-d5bd-4b33-9c13-a72f67a14867","inputWidgets":{},"title":""}}},{"cell_type":"code","source":["query_string ='''\nWITH [\"ibuprofen\", \"naproxen\", \"diclofenac\", \"indometacin\", \"ketorolac\", \"aspirin\", \"ketoprofen\", \"dexketoprofen\", \"meloxicam\"] AS nsaids\nMATCH (p:Patient)-[r1:RXNORM_CODE]->(rx:RxNorm)-[r2]->(d:Drug)\nWHERE any(word IN nsaids WHERE d.name CONTAINS word) \nWITH DISTINCT p.name as patients, COLLECT(DISTINCT d.name) as nsaid_drugs, COUNT(DISTINCT d.name) as num_nsaids\nMATCH (p:Patient)-[r1:RXNORM_CODE]->(rx:RxNorm)-[r2]->(d:Drug)\nWHERE p.name=patients AND d.name CONTAINS 'warfarin'\nRETURN DISTINCT patients, \n                nsaid_drugs, \n                num_nsaids, \n                d.name as warfarin_drug, \n                r1.date as date\n'''\n\ndf = pd.DataFrame([dict(_) for _ in conn.query(query_string)])\ndf"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"8baa596f-70e2-45df-b01d-210b738cd59a","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Out[28]: </div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Out[28]: </div>"]}},{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>patients</th>\n      <th>nsaid_drugs</th>\n      <th>num_nsaids</th>\n      <th>warfarin_drug</th>\n      <th>date</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>19823</td>\n      <td>[diclofenac potassium 25 mg [zipsor], aspirin ...</td>\n      <td>9</td>\n      <td>warfarin</td>\n      <td>2172-06-22</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>19823</td>\n      <td>[diclofenac potassium 25 mg [zipsor], aspirin ...</td>\n      <td>9</td>\n      <td>warfarin sodium 1 mg</td>\n      <td>2172-06-22</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>19823</td>\n      <td>[diclofenac potassium 25 mg [zipsor], aspirin ...</td>\n      <td>9</td>\n      <td>warfarin sodium 1 mg [coumadin]</td>\n      <td>2170-10-12</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>19823</td>\n      <td>[diclofenac potassium 25 mg [zipsor], aspirin ...</td>\n      <td>9</td>\n      <td>warfarin sodium 2.5 mg [coumadin]</td>\n      <td>2167-11-27</td>\n    </tr>\n  </tbody>\n</table>\n</div>","textData":null,"removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"htmlSandbox","arguments":{}}},"output_type":"display_data","data":{"text/html":["<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>patients</th>\n      <th>nsaid_drugs</th>\n      <th>num_nsaids</th>\n      <th>warfarin_drug</th>\n      <th>date</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>19823</td>\n      <td>[diclofenac potassium 25 mg [zipsor], aspirin ...</td>\n      <td>9</td>\n      <td>warfarin</td>\n      <td>2172-06-22</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>19823</td>\n      <td>[diclofenac potassium 25 mg [zipsor], aspirin ...</td>\n      <td>9</td>\n      <td>warfarin sodium 1 mg</td>\n      <td>2172-06-22</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>19823</td>\n      <td>[diclofenac potassium 25 mg [zipsor], aspirin ...</td>\n      <td>9</td>\n      <td>warfarin sodium 1 mg [coumadin]</td>\n      <td>2170-10-12</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>19823</td>\n      <td>[diclofenac potassium 25 mg [zipsor], aspirin ...</td>\n      <td>9</td>\n      <td>warfarin sodium 2.5 mg [coumadin]</td>\n      <td>2167-11-27</td>\n    </tr>\n  </tbody>\n</table>\n</div>"]}}],"execution_count":0},{"cell_type":"code","source":["# To obtain the visualization below, run the following query in Neo4j Browser:\n\nquery_string = '''\n    WITH [\"ibuprofen\", \"naproxen\", \"diclofenac\", \"indometacin\", \"ketorolac\", \"aspirin\", \"ketoprofen\", \"dexketoprofen\", \"meloxicam\"] AS nsaids\n    MATCH (p:Patient)-[r1:RXNORM_CODE]->(rx:RxNorm)-[r2]->(d:Drug)\n    WHERE any(word IN nsaids WHERE d.name CONTAINS word) \n    WITH DISTINCT p.name as patients, COLLECT(DISTINCT d.name) as nsaid_drugs, COUNT(DISTINCT d.name) as num_nsaids\n    MATCH (p:Patient)-[r1:RXNORM_CODE]->(rx:RxNorm)-[r2]->(d:Drug)\n    WHERE p.name=patients AND d.name CONTAINS 'warfarin'\n    RETURN p, rx, d, r1, r2;\n    '''"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"6090486e-91e0-4b3d-ae69-f19c184bac99","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\"></div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\"></div>"]}}],"execution_count":0},{"cell_type":"markdown","source":["<img src=\"https://raw.githubusercontent.com/iamvarol/blogposts/main/databricks/images/ddc.png\">"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"803e3872-b397-48a0-8f59-419aac48430b","inputWidgets":{},"title":""}}},{"cell_type":"markdown","source":["**patients who underwent a hernia repair or appendectomy, or cholecystectomy:**"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"8ef11876-62c1-48ea-907b-6effdb2ecd12","inputWidgets":{},"title":""}}},{"cell_type":"code","source":["query_string = \"\"\"\nMATCH (pcd1:Procedure)-[rel1:IS_PROCEDURE]-(pati1:Patient)\nWHERE pcd1.name CONTAINS 'hernia repair' OR pcd1.name CONTAINS 'appendectomy' OR pcd1.name CONTAINS 'cholecystectomy'\nRETURN DISTINCT pati1.name as patients, \n                COLLECT(DISTINCT toLower(pcd1.name)) as procedures\n\"\"\"\n\ndf = pd.DataFrame([dict(_) for _ in conn.query(query_string)])\ndf"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"6c57fd50-ff9b-4dc9-bd2e-ee41f1e568df","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Out[30]: </div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Out[30]: </div>"]}},{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>patients</th>\n      <th>procedures</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>21153</td>\n      <td>[hernia repair, appendectomy]</td>\n    </tr>\n  </tbody>\n</table>\n</div>","textData":null,"removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"htmlSandbox","arguments":{}}},"output_type":"display_data","data":{"text/html":["<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>patients</th>\n      <th>procedures</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>21153</td>\n      <td>[hernia repair, appendectomy]</td>\n    </tr>\n  </tbody>\n</table>\n</div>"]}}],"execution_count":0},{"cell_type":"code","source":["# patients with chest pain and shortness of breath\nquery_string = \"\"\"\nMATCH (p1:Patient)-[r1:IS_SYMPTOM]->(s1:Symptom),\n(p2:Patient)-[r2:IS_SYMPTOM]->(s2:Symptom)\nWHERE s1.name CONTAINS \"chest pain\" AND s2.name CONTAINS \"shortness of breath\"\n    AND p2.name=p1.name AND r2.date = r1.date\nRETURN DISTINCT p1.name as patient, r1.date as date,s1.name as symptom1, s2.name as symptom2\nORDER BY patient\n\"\"\"\ndf = pd.DataFrame([dict(_) for _ in conn.query(query_string)])\ndf"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"12fe34df-46b9-4a76-81e5-b18b7c308cf2","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Out[31]: </div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Out[31]: </div>"]}},{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>patient</th>\n      <th>date</th>\n      <th>symptom1</th>\n      <th>symptom2</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>chest pain</td>\n      <td>shortness of breath</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>19823</td>\n      <td>2170-10-12</td>\n      <td>chest pain</td>\n      <td>shortness of breath</td>\n    </tr>\n  </tbody>\n</table>\n</div>","textData":null,"removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"htmlSandbox","arguments":{}}},"output_type":"display_data","data":{"text/html":["<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>patient</th>\n      <th>date</th>\n      <th>symptom1</th>\n      <th>symptom2</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>chest pain</td>\n      <td>shortness of breath</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>19823</td>\n      <td>2170-10-12</td>\n      <td>chest pain</td>\n      <td>shortness of breath</td>\n    </tr>\n  </tbody>\n</table>\n</div>"]}}],"execution_count":0},{"cell_type":"markdown","source":["**patients with hypertension or diabetes with chest pain:**"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"3ed3fc32-c112-4677-a4a7-75dbbdfa5123","inputWidgets":{},"title":""}}},{"cell_type":"code","source":["query_string = \"\"\"\nMATCH (p:Patient)-[r:IS_SYMPTOM]->(s:Symptom),\n(p1:Patient)-[r2:IS_DSD]->(_dsd:DSD)\nWHERE s.name CONTAINS \"chest pain\" AND p1.name=p.name AND _dsd.name IN ['hypertension', 'diabetes'] AND r2.date=r.date\nRETURN DISTINCT p.name as patient, r.date as date, _dsd.name as dsd, s.name as symptom\n\"\"\"\ndf = pd.DataFrame([dict(_) for _ in conn.query(query_string)])\ndf"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"b0247b01-e573-4c82-92f3-5c6944706f0e","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\">Out[32]: </div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\">Out[32]: </div>"]}},{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>patient</th>\n      <th>date</th>\n      <th>dsd</th>\n      <th>symptom</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>27386</td>\n      <td>2189-07-06</td>\n      <td>hypertension</td>\n      <td>chest pain</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>hypertension</td>\n      <td>chest pain</td>\n    </tr>\n  </tbody>\n</table>\n</div>","textData":null,"removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"htmlSandbox","arguments":{}}},"output_type":"display_data","data":{"text/html":["<div>\n<style scoped>\n    .dataframe tbody tr th:only-of-type {\n        vertical-align: middle;\n    }\n\n    .dataframe tbody tr th {\n        vertical-align: top;\n    }\n\n    .dataframe thead th {\n        text-align: right;\n    }\n</style>\n<table border=\"1\" class=\"dataframe\">\n  <thead>\n    <tr style=\"text-align: right;\">\n      <th></th>\n      <th>patient</th>\n      <th>date</th>\n      <th>dsd</th>\n      <th>symptom</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>27386</td>\n      <td>2189-07-06</td>\n      <td>hypertension</td>\n      <td>chest pain</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>19823</td>\n      <td>2167-02-25</td>\n      <td>hypertension</td>\n      <td>chest pain</td>\n    </tr>\n  </tbody>\n</table>\n</div>"]}}],"execution_count":0},{"cell_type":"code","source":["# To obtain the visualization below, run the following query in Neo4j Browser:\n\nquery_string = '''\n  MATCH (p:Patient)-[r:IS_SYMPTOM]->(s:Symptom),\n  (p1:Patient)-[r2:IS_DSD]->(_dsd:DSD)\n  WHERE s.name CONTAINS \"chest pain\" AND p1.name=p.name AND _dsd.name IN ['hypertension', 'diabetes'] AND r2.date=r.date\n  RETURN DISTINCT p, r, _dsd, s;\n  '''"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"29c69851-2587-4f51-b68f-8069f031fcfb","inputWidgets":{},"title":""}},"outputs":[{"output_type":"display_data","metadata":{"application/vnd.databricks.v1+output":{"datasetInfos":[],"data":"<div class=\"ansiout\"></div>","removedWidgets":[],"addedWidgets":{},"metadata":{},"type":"html","arguments":{}}},"output_type":"display_data","data":{"text/html":["<style scoped>\n  .ansiout {\n    display: block;\n    unicode-bidi: embed;\n    white-space: pre-wrap;\n    word-wrap: break-word;\n    word-break: break-all;\n    font-family: \"Source Code Pro\", \"Menlo\", monospace;;\n    font-size: 13px;\n    color: #555;\n    margin-left: 4px;\n    line-height: 19px;\n  }\n</style>\n<div class=\"ansiout\"></div>"]}}],"execution_count":0},{"cell_type":"markdown","source":["<img src=\"https://raw.githubusercontent.com/iamvarol/blogposts/main/databricks/images/chest_pain.png\">"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"d47a50a1-ed9b-4c6f-bd77-811620af5ff5","inputWidgets":{},"title":""}}},{"cell_type":"markdown","source":["## License\nCopyright / License info of the notebook. Copyright [2021] the Notebook Authors.  The source in this notebook is provided subject to the [Apache 2.0 License](https://spdx.org/licenses/Apache-2.0.html).  All included or referenced third party libraries are subject to the licenses set forth below.\n\n|Library Name|Library License|Library License URL|Library Source URL|\n| :-: | :-:| :-: | :-:|\n|Pandas |BSD 3-Clause License| https://github.com/pandas-dev/pandas/blob/master/LICENSE | https://github.com/pandas-dev/pandas|\n|Numpy |BSD 3-Clause License| https://github.com/numpy/numpy/blob/main/LICENSE.txt | https://github.com/numpy/numpy|\n|Neo4j |Apache License 2.0|https://github.com/neo4j/neo4j/blob/4.4/LICENSE.txt|https://github.com/neo4j/neo4j|\n|Apache Spark |Apache License 2.0| https://github.com/apache/spark/blob/master/LICENSE | https://github.com/apache/spark/tree/master/python/pyspark|\n|BeautifulSoup|MIT License|https://www.crummy.com/software/BeautifulSoup/#Download|https://www.crummy.com/software/BeautifulSoup/bs4/download/|\n|Requests|Apache License 2.0|https://github.com/psf/requests/blob/main/LICENSE|https://github.com/psf/requests|\n|Spark NLP Display|Apache License 2.0|https://github.com/JohnSnowLabs/spark-nlp-display/blob/main/LICENSE|https://github.com/JohnSnowLabs/spark-nlp-display|\n|Spark NLP |Apache License 2.0| https://github.com/JohnSnowLabs/spark-nlp/blob/master/LICENSE | https://github.com/JohnSnowLabs/spark-nlp|\n|Spark NLP for Healthcare|[Proprietary license - John Snow Labs Inc.](https://www.johnsnowlabs.com/spark-nlp-health/) |NA|NA|\n\n\n\n\n|Author|\n|-|\n|Databricks Inc.|\n|John Snow Labs Inc.|"],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"fec82b0b-692e-4b85-939e-99cfb279e03c","inputWidgets":{},"title":""}}},{"cell_type":"markdown","source":["## Disclaimers\nDatabricks Inc. (“Databricks”) does not dispense medical, diagnosis, or treatment advice. This Solution Accelerator (“tool”) is for informational purposes only and may not be used as a substitute for professional medical advice, treatment, or diagnosis. This tool may not be used within Databricks to process Protected Health Information (“PHI”) as defined in the Health Insurance Portability and Accountability Act of 1996, unless you have executed with Databricks a contract that allows for processing PHI, an accompanying Business Associate Agreement (BAA), and are running this notebook within a HIPAA Account.  Please note that if you run this notebook within Azure Databricks, your contract with Microsoft applies."],"metadata":{"application/vnd.databricks.v1+cell":{"showTitle":false,"cellMetadata":{},"nuid":"31400de6-256b-4651-a9ff-feb1390a2d71","inputWidgets":{},"title":""}}}],"metadata":{"application/vnd.databricks.v1+notebook":{"notebookName":"20.1. SparkNLP_KG_DBr_Demo_part2","dashboards":[],"notebookMetadata":{"pythonIndentUnit":2},"language":"python","widgets":{},"notebookOrigID":470726586544466}},"nbformat":4,"nbformat_minor":0}
