{
    "text": "PRENOM : Aurélie\nNOM : Perrier\nNUMÉRO DE SÉCURITÉ SOCIALE : 2190150502008\nADRESSE : 8 Rue Faivre\nVIL... \nPRENOM : Aurélie\nNOM : Perrier\nNUMÉRO DE SÉCURITÉ SOCIALE : 2190150502008\nADRESSE : 8 Rue Faivre\nVILLE : Bousquet\nCODE POSTAL : 11631\nDATE DE NAISSANCE : 22/10/1960\nÂge : 44 ans \nSexe : Femme\nCOURRIEL : aurelieprr@orange.fr\nDATE D'ADMISSION : 31/12/2004\nMÉDÉCIN : Dr Alain Bouvet\nRAPPORT CLINIQUE : \nMotif de l'admission : Aurélie Perrier âgée de 44 ans, adressée à notre unité en raison d'une augmentation de volume dans la région zygomatique et d'une limitation progressive de l'ouverture de la bouche depuis 10 mois. Les antécédents médicaux n'étaient pas pertinents. \nExamen : L'examen physique extraoral a montré une asymétrie faciale due à une augmentation de volume de la joue gauche, de limites diffuses, de consistance osseuse, indolore, avec une peau d'apparence normale. L'ouverture de la bouche était de 30 mm. L'articulation temporomandibulaire (ATM) était normale à la palpation, avec des bruits ou des douleurs à l'ouverture. Sur l'orthopantomographie, nous avons observé une hypertrophie du processus coronoïde gauche. L'hypothèse diagnostique était une tumeur coronoïde.\nTests complémentaires et évolution : Une incision a été pratiquée sur le bord antérieur du ramus mandibulaire, en désinsérant toutes les insertions du muscle temporal. Une pseudocapsule fibreuse a été trouvée autour de l'élargissement, qui a été libérée. Une coronoïdectomie a été effectuée. L'ouverture buccale a été immédiatement restaurée à 43 mm. L'évolution postopératoire s'est déroulée sans incident avec une sortie de l'hôpital après 48 heures.\nL'étude histopathologique a signalé la présence de fibres, d'os de néoformation et de tissu cartilagineux hyalin. Les contrôles ultérieurs se sont déroulés sans incident. La sortie définitive a été donnée à 10 mois, avec un remodelage presque complet de la déformation des joues.\nADDRESSÉ À : Dr Joseph Pasquier - Centre Hospitalier de Carcassonne - 1060 Chemin de la Madeleine, 11000 Carcassonne\nNUMÉRO DE TÉLÉPHONE : 06-71105388\nCOURRIEL : pasquier@orange.fr"
}