{
    "text": [
        "Dados do paciente. Nome: Mauro. Apelido: Gonçalves. NISS: 26 63514095. Endereço: Calle Miguel Benitez 90.\nCÓDIGO POSTAL: 28016. Dados de cuidados. Data de nascimento: 03/03/1946. País: Portugal. Idade: 70 anos Sexo: M. Data de admissão: 12/12/2016.\nDoutor: Ignacio Navarro Cuéllar NºCol: 28 28 70973. Relatório clínico do paciente: Paciente de 70 anos, mineiro reformado, sem alergias medicamentosas conhecidas, que apresenta como história pessoal: acidente de trabalho antigo com fracturas vertebrais e das costelas; operado por doença de Dupuytren na mão direita e iliofemoral esquerda; Diabetes Mellitus tipo II, hipercolesterolemia e hiperuricemia; alcoolismo activo, fumador de 20 cigarros / dia.\nFoi encaminhado dos cuidados primários porque apresentou uma vez hematúria macroscópica pós-morte e depois microhaematúria persistente, com micturição normal.\nO exame físico mostrou um bom estado geral, com abdómen e genitália normais; o exame rectal foi compatível com adenoma de próstata de grau I/IV.\nA urinálise mostrou 4 glóbulos vermelhos/campo e 0-5 leucócitos/campo; o resto do sedimento estava normal.\nHemograma normal; a bioquímica mostrou glicemia de 169 mg/dl e triglicéridos de 456 mg/dl; função hepática e renal normal. PSA de 1,16 ng/ml.\nA citologia da urina era repetidamente desconfiada por malignidade.\nA radiografia simples abdominal mostra alterações degenerativas na coluna lombar e calcificações vasculares tanto no hipocôndrio como na pélvis.\nA ecografia urológica revelou cistos corticais simples no rim direito, uma bexiga inalterada com boa capacidade e uma próstata com 30g de peso.\nO IVUS mostrou normofuncionalismo renal bilateral, calcificações na silhueta renal direita e ureteres artrosados com imagens de adição no terço superior de ambos os ureteres, relacionadas com pseudodiverticulose ureteral. O cistograma mostra uma bexiga com boa capacidade, mas com paredes trabeculadas em relação à bexiga de stress. A tomografia computorizada abdominal é normal.\nA cistoscopia revelou a existência de pequenos tumores na bexiga, e a ressecção transuretral foi realizada com o resultado anatomopatológico do carcinoma urotelial superficial da bexiga.\nReferido por: Miguel Santos - Avenida dos Aliados, 22 Portugal E-mail: nnavcu@hotmail.com.",
        "NOME: Pedro Gonçalves\nNHCPedro Gonçalves08A\nENMVANSK92F09W408Aardo 7\nCÓDIRua Burcardo 7ELAÇÃO HOSPITALA80139E: Pedro Gonçalves\nNH03/03/19462F09W40870ENDEREÇO: RuHomensardo 7\nCÓpgon21@tim.pt80139\nDATA DE NASCI12/12/201603/1946\nIDEva Andrades\nSEXO: Homens\nE-70IL: pgon21@tim.pt\nDATA DE ADMISSÃO: 12/12/2016\nDOUTORA: Eva Andrade\nRELATO CLÍNICO: 70 anos, aposentado, sem alergia a medicamentos conhecida, com a seguinte história: ex-acidente de trabalho com fratura de vértebras e costelas; operado de doença de Dupuytren na mão direita e ponte ílio-femoral esquerda; diabetes tipo II, hipercolesterolemia e hiperuricemia; alcoolismo ativo, fuma 20 cigarros/dia.\nEle foi-nos encaminhado por apresentar hematúria macroscópica pós-evacuação em uma ocasião e microhematúria persistente posteriormente, com evacuação normal.\nO exame físico mostrou bom estado geral, com abdome e genitais normais; o toque retal foi compatível com adenoma de próstata grau I/IV.\nA urinálise mostrou 4 hemácias/campo e 0-5 leucócitos/campo; o resto do sedimento era normal.\nO hemograma é normal; a bioquímica mostrou uma glicemia de 169 mg/dl e triglicerídeoEva Andrade; função hHospitalar do Medio AvemaiAvenida Dos Aliadosl.\n\nDIRIGIDA evandrade@poste.pt - Centro Hospitalar do Medio Ave - Avenida Dos Aliados, 56\nE-MAIL: evandrade@poste.pt"
    ],
    "masking_policy": "masked"
}