{"text": "Samantha Brown came to my clinic for a consultation regarding the option of bariatric surgery for weight loss on November 12, 2010. Samantha Brown, a 38-year-old woman with a BMI of 46, is 5'7\" tall and weighs 293 pounds. The reason she is considering surgical intervention for weight loss is her ongoing struggle with obesity for more than 25 years and her desire to enhance her physical stamina and self-perception. Not only does her weight cause physical limitations, it also hampers her social interactions. Every time she has lost weight, she has ended up regaining it, often adding more pounds than she initially lost. For instance, she once shed 120 pounds, only to gain it back within a year. She has attempted various commercial diets and weight loss programs, such as Jenny Craig for five months in 1993 with a 20-pound loss, Optifast for three months in 1991 with a seven-pound loss, Herbalife for seven weeks in 2006 with a nine-pound loss, a gym regimen for three months in 2008 with a six-pound loss, South Beach Diet for four months in 2009 with a twelve-pound loss, and Alli for two months in 2006 with a six-pound loss. She has also experimented with numerous low-fat or fad diets. She took Fen-Phen for ten months with a 120-pound loss.\n    PAST MEDICAL HISTORY: She has a history of diabetes and sleep apnea.\n\n\n    PAST SURGICAL HISTORY: Noteworthy for appendectomy.\n\n\n    PSYCHOLOGICAL HISTORY: Unremarkable.\n\n\n    SOCIAL HISTORY: She is divorced. She has an occasional glass of wine. She has never smoked.\n\n\n    FAMILY HISTORY: Significant for obesity and type 2 diabetes.\n\n\n    MEDICATIONS: Metformin 500 mg twice daily, Amlodipine 5 mg daily, Lipitor 20 mg daily, Metoprolol 50 mg twice daily, and a daily multivitamin.\n\n\n    ALLERGIES: No known drug allergies.\n\n\n    REVIEW OF SYSTEMS: Unremarkable.\n\n\n    PHYSICAL EXAM: Samantha is an amiable woman appearing comfortable. Alert and fully oriented. HEENT: Normocephalic, without trauma. Extraocular movements are intact, sclerae are non-icteric. Lungs are clear upon bilateral auscultation. Cardiovascular system shows a regular rhythm. Abdomen is obese, pliable, without tenderness or distension. Extremities exhibit no signs of edema, clubbing, or cyanosis.\n\n\n    ASSESSMENT/PLAN: Samantha Brown is a 38-year-old woman with a BMI of 46, who is contemplating bariatric surgery, specifically gastric bypass rather than the Lap-Band. Samantha Brown will be requesting a letter of medical necessity from Dr. Benjamin Harris. She will also schedule appointments with my nutritionist and social worker, and will undergo an upper endoscopy. Once these steps are done, we will forward her application to her insurance company for approval."}
{"text": "Patient Name: John Davis\n    Age: 45\n\n\n    Gender: Male\n\n\n    Diagnosis: Acute Appendicitis\n\n\n    Procedure: Appendectomy\n\n\n    Summary: Mr. Davis presented with severe abdominal pain localized to the right lower quadrant. Physical examination and imaging confirmed the diagnosis of acute appendicitis. The patient underwent an emergency appendectomy, and the procedure was uneventful. Postoperatively, the patient recovered well and was discharged after two days."}