{"text": "INTERPRETATION: No significant pericardial effusion was identified.\n    The aortic root dimensions are within normal limits. The four cardiac chambers dimensions are within normal limits. No discrete regional wall motion abnormalities are identified. The left ventricular systolic function is preserved with an estimated ejection fraction of 60%. The left ventricular wall thickness is within normal limits.\n\n    The aortic valve is trileaflet with adequate excursion of the leaflets. The mitral valve and tricuspid valve motion is unremarkable. The pulmonic valve is not well visualized.\n\n    Color flow and conventional Doppler interrogation of cardiac valvular structures revealed mild mitral regurgitation and mild tricuspid regurgitation with an RV systolic pressure calculated to be 28 mmHg. Doppler interrogation of the mitral in-flow pattern is within normal limits for age.\n\n    IMPRESSION:\n\n    1-Preserved left ventricular systolic function.\n\n    2-Mild mitral regurgitation.\n\n    3-Mild tricuspid regurgitation."}
{"text": "CT ABDOMEN WITHOUT CONTRAST AND CT PELVIS WITHOUT CONTRAST\n    REASON FOR EXAM: Evaluate for retroperitoneal hematoma, the patient has been following, is currently on Coumadin.\n\n\n    CT ABDOMEN: There is no evidence for a retroperitoneal hematoma.\n\n\n    The liver, spleen, adrenal glands, and pancreas are unremarkable. Within the superior pole of the left kidney, there is a 3.9 cm cystic lesion. A 3.3 cm cystic lesion is also seen within the inferior pole of the left kidney. No calcifications are noted. The kidneys are small bilaterally.\n\n\n    CT PELVIS: Evaluation of the bladder is limited due to the presence of a Foley catheter, the bladder is nondistended. The large and small bowels are normal in course and caliber. There is no obstruction.\n\n\n    Bibasilar pleural effusions are noted.\n\n\n    IMPRESSION:\n\n\n    1-No evidence for retroperitoneal bleed.\n\n\n    2-There are two left-sided cystic lesions within the kidney, correlation with a postcontrast study versus further characterization with an ultrasound is advised as the cystic lesions appear slightly larger as compared to the prior exam.\n\n\n    3-The kidneys are small in size bilaterally.\n\n\n    4-Bibasilar pleural effusions."}